label chapter2:
    # глава 02
    
    #(Вариант AngelRanga редактор Saitar1337)

    call chapter_02_splashscr

    #centered "{color=#ff0000}{b}{size=+10}Глава 02. Граница Между Сном и Явью{/size}{/b}{/color}"

    call chapt_02_splashscr

    #centered "{color=#7fbdbf}{i}А на утро выпал снег.{/i}{/color}"
    #centered "{color=#7fbdbf}{i}В моем саду уж не цветет сирен{/i}{/color}"
    #centered "{color=#7fbdbf}{i}В иллюзиях и в мечтаний{/i}{/color}"
    #centered "{color=#7fbdbf}{i}Девочка бродит одна по миру снегов и льда. {/i}{/color}"

    e "Ночью пришла снежная буря, принёсшая с собой миллионы острых как бритва снежинок. "
    e "Мир преобразился в белую пустошь. "
    e "Океан скрылся за пеленой густого, словно кисель, серого тумана… "

    e "Маленькая Ведьма проснулась. "
    e "Перебирая в своей памяти остатки увядающих как лепестки сакуры снов, "
    e "она приготовила себе завтрак из заготовленных на зиму запасов.  "
    e "Основательно подкрепившись, она решила пойти на Солёное озеро, намереваясь заготовить так нужнее ей средства снов. "
    e "Одевшись и экипировавшись, закрепив поясные подсумки для трофеев в взяв с собой кинжал, "
    e "Маленькая Ведьма попыталась открыть входную дверь. "

    e "Но ничего не вышло…"
    
    LW " - Ничего себе столько снега навалило! "
    LW "Как же я открою дверь? "

    e "Дверь и правда была настолько заваленной снегом, "
    e "что Маленькой Ведьме пришлось навалиться на нее плечом. "
    e "Протяжно скрипя, словно старческие артритные суставы, дверь с трудом поддавалась физическому воздействию."
    e "Наконец, она всё-таки распахнулась, и Маленькая Ведьма буквально вывалилась на улицу в сугроб. "
    e "Раскинув руки, она разлеглась в пушистом и таком колючем снегу. "
    e "Поднимаясь из сугроба и отряхиваясь от снега, она огляделась по сторонам."

    e "................"

    e " Снег был везде. "
    e "Он покрывал дом Ведьмы, словно большая пушистая шапка с ушами, "
    e "надетая на крышу её хижины, "
    e "и расползался толстым слоем белой ваты по земле, обрамляя пики острых, как бритва, скал. "
    e "То, что предполагалось непродолжительной утренней прогулкой – превращалось в целый зимний поход по сугробам… "
    

    e " Ведомая демоном-искусителем, "
    e "Ведьма почувствовала возбуждение от неожиданно наступившей белой сказки и предчувствия... "
    e "Она никогда не испытывала такого предчувствия и предвкушения скорой встречи с кем-то или чем-то… "

    LW "{i}« - Это произойдёт уже очень скоро, »{/i}"

    e "– думала она в слух, не имея понятия что именно произойдёт, но явственно ощущая важность и неумолимость предстоящего,  "
    
    LW "{i}«-  Но я перечислю все знаки числа „пи“ до того, как доберусь до озера через эти все сугробы... ». {/i} "
    
    e "Ей не терпелось увидеть новую историю, которую она не знала. "
    e "Пробираясь через белую пустыню девственно-чистого снежного наста, она размышляла о бренности бытия."

    LW "{i}« Острый, словно хирургический скальпель, ум Наставницы, облеченный в мягкие формы, часто приобретал насмешливый, почти иронический оттенок.  {/i}"
    LW "{i}В эти периоды Наставница говорила: что мир вокруг – всего лишь голограмма. {/i}"
    LW "{i}А то, что принимается за реальность – сложные игры интерференционных рисунков и сознания наблюдателя. {/i}"
    LW "{i}Крошечные фотоны света обладают загадочным, трудно постижимым для простого обывателя свойством. {/i}"
    LW "{i}Они имеют двойственную природу – существуют и как материальные объекты, и как волновые образования. {/i} "
    LW "{i}И представляют собой не совокупность микроскопических материальных тел, а кратковременное взаимное наложение (сгущение) энергетических полей...» {/i}"
    

    e "Сны внушали Маленькой Ведьме, что любая форма в пространстве образуется при пересечении той или иной фигуры с большим количеством измерений.  "
    e "Квадрат это результат сечения куба,{w=1} а круг – результат сечения сферы."
    e "Если взять самую обычную сферу, {w=1}то любую точку на ней можно задать двумя параметрами — параллелью и меридианой.  "
    e "Поэтому логично полагать, {w=1}что сфера — это двумерное пространство. "
    e "Просто оно не плоское, а вот такое вот сферическое и замкнутое само на себя. "

    e "Другие сферы, имеющие количество протяжённых измерений больше трёх,{w=1} представить сложнее – но они встречаются столь же часто. "
    e "Это трёхмерные сферы, подобные поверхностям надувных мячей,"
    e " в которые играют на песчаных океанических пляжах во вселенной с четырьмя протяженными пространственными измерениями. "
    e "Что обычные люди до сих пор лишь изредка наблюдают в своих снах, но обычно не могут вспомнить.  "
    
    e "Так Маленькая Ведьма размышляла над загадками бытия, в конечном итоге – завершив свои размышления следующим:"

    LW "{i}« Последний шаг разума заключается в том, чтобы признать существование множества таких вещей, которые выходят за пределы познания.  {/i}"
    LW "{i} И если разум не приходит к осознанию этого ввода, то он весьма слабый…» {/i}"

    e "............."
    e ".........."
    e "....."

    e "И вот девочка очутилась на берегу небольшого Солёного озера. "
    e "Её взгляд окинул покрытую серой снежной кашей мутную водную поверхность, над которой висел клочковатый рыжий туман. "

    nvl clear

    window hide
    nvl show #dissolve

    centered "{font=font/GOST_A.ttf}{color=#c8ffc8}{i}{size=+10}Солёное озеро, как, впрочем, и ущелье,\n
                в котором оно расположено - напоминают двуликого Януса,\n 
                так непосредственны и переменчивы.\n 
                Зимой вода в озере всегда пресная.\n
                И тёплая, словно парное молоко.\n
                Если набрать её, то в открытой посуде можно хранить годами - и она не утратит родниковой свежести.\n
                Однако на излёте зимы, в первых фазах третьей луны - начинается резкое, скачкообразное засоление. \n
                Да такое стремительное, что уже к концу фазы третьей луны - утонуть в озере при всём желании становится невозможным.\n
                Ущелье же не всякого пришлого примет. \n
                Находиться среди трухлявых вывалов, стоящих стеной деревьев и одуряющее пахнущего разнотравья могла только Ведьма,\n
                привыкшая к причудам местной природы и климата.{/size}{/i}{/color}{/font}"

    nvl clear
    window show

    e "Девочка прошла вдоль обрывистого бережка, обогнув его, и приблизилась к крутому массиву скал. "
    e "Там была расщелина, ведущая в систему гигантских пещер, в вечную темноту которых не проникал ни единый лучик звёздного света. "
    e "Там обитали пауки снов, плетущие паутины грёз. "
    e "Она охотилась на них, добывая из их желёз средства снов, помогавшие ей путешествовать по чужим снам."

    e " Она осторожно подошла к расщелине, зиявшей опасным чёрным провалом посреди белого мира."
    e "Снег покрывал только ближайшие несколько шагов, а дальше начиналась голая неровная поверхность из скальных пород. "
    e "Зайдя под обрамлённые сталактитами своды, девочка вошла в чёрный подземный мир.  "
    e "Но полностью тёмным он не был…"
   
    e " Сперва путь Маленькой Ведьмы освещало только тусклое поблескивание минералов, "
    e "да пробивавшиеся через редкие дыры в своде столбы света, в которых водили хороводы пылинки... "
    e "Но с каждым шагом вперёд и вниз, куда уже не доставал внешний свет – подземный мир преображался…"
    e "То тут, то там на глаза попадались холодно светившиеся в темноте пятна голубого мха на стенках влажных сводов пещеры. "
    e "Наростами террас произрастали колонии белых мясистых грибов довольно больших размеров."
    e "Влага, собиравшаяся в чаши посредине их шляпок, блистала в мертвящем сиянии небольшими озерцами.  "
    e "Грибы мерцали холодным свечением, которое практически ничего не освещало, "
    e "а рядом с ними вились крупные светляки и бабочки-мотыльки с голубоватыми крыльями. "
   

    e " Достав из одного из своих подсумков небольшую гладкую сферу,  "
    e "Маленькая Ведьма зажгла её магическим пассом. "
    e "Вспыхнув ярким, но не обжигающим пламенем на ладони, эта сфера вырывала тьму из пространства вокруг девочки, оставляя за её спиной длинную тень… "

    e "Сначала мхов и грибов видно немного. "
    e "Но по мере того,"
    e " как осторожные шаги уводили Маленькую Ведьму вглубь подземного царства {w=1} – оно становилось всё более исполненным этой причудливой жизнью. "
    e "Грибы становились крупнее, а мох застилал пушистым голубым ковром всё доступное взгляду пространство. "
    e "Вся пещера мерцала мягким голубоватым свечением, а после каждого шага в воздух взмывали облачка спор, чуть заметно искрившихся в воздухе.  "

    e "Галерея, по которой она шла, уходила под наклоном, а потом делала поворот. "
    e "От неё отделялись другие галереи, оканчивающиеся залами, из которых вели другие проходы и залы.  "
    e "Это был сложный лабиринт, состоявший из бесконечного множества пещер и коридоров. "
    e "Наконец, своды разошлись в стороны, образуя большой просторный зал, "
    e "в которой сталактиты и сталагмиты срастались воедино, а оплетавший их мох образовывал некоторое подобие деревьев. "
    e "Пещера и правда выглядела как причудливый колдовской лес, находящийся скорее в сладком сне, нежели наяву."

    e "Среди переливов сияющего мха и грибов Маленькая Ведьма, наконец, разглядела то, "
    e "что искала: паутину грез, растянутую в проёме арки над звонко журчащей подземной речушкой. "
    e "Паутина под аркой цеплялась своими нитями за выступы и ближайшие сосульки «деревьев» . "
    e "Её клейкие нити сияли в темноте гораздо ярче, чем всё, что ее окружало, образуя причудливые фракталы из пёстрых цветастых пятен. "
   

    e "Словно мотылёк, порхающий на пламя свечи, Маленькая Ведьма устремилась к переливающейся разноцветным сиянием паутине,"
    e " бесшумно вынув острый кинжал из ножен. "
    e "Потушив сферу, она смогла сориентироваться в сгустившемся мраке по сиянию паутины грёз. "
    e "Насколько она понимала,"
    e " добыча попадала в смертельные объятия паутины именно что приманенная этим необычным свечением в мире постоянной полутьмы.  "
    e "Судя по яркости нитей, паук снов сплёл их совсем недавно {w=1}– паутина не успела потускнеть и не была порвана попавшими в неё жертвами."

    e "На тактическом ремне позвякивает, зачарованный кинжал, словно напоминая:{w=1} «Не забывай об опасности»."

    e "Наконец, Ведьма увидела паука снов, застывшего, словно чёрная тень, в верхнем углу возле одной из нитей паутины. "
    e "Лохматые короткие педипальцы, прикрывавшие его ротовую полость,"
    e " нетерпеливо подёргивались, а в многочисленных бусинках глаз отражалось бликами его светящееся «творение»."
    e " Это был самец. "

    e "Самцы пауков снов – это крупные особи, размером примерно с кошку, поджидающие своих жертв в засаде недалеко от паутины грёз. "
    e "Самка обычно находится где-то поблизости от самца.  "
    e "В отличие от большинства земных пауков, самки которых обычно сжирают самцов после оплодотворения, "
    e "снов образовывают брачный союз до конца своей жизни. "
    e "Охотятся они тоже вдвоём. "
    e "И пока самец ожидает в засаде возле паутины, самка ползает по окрестностям. "
    e "Впрочем, стараясь не отходить слишком далеко… "
    e "Ведьма не хотела убивать самца {w=1}– ей нужна была именно паучиха грёз…"

    e "Острый слух Маленькой Ведьмы уловил отчаянное трепыхание,  "
    e "а взор подтвердил догадку {w=1}– в мерцающую западню попало довольно крупное фееобразное существо размером с маленького ребёнка."
    e "Маленькая ведьма никогда раньше не замечала таких обитателей в этой местности."
    e "Добыча верещала, пытаясь высвободить запутавшиеся в клейкой паутине конечности и птичьи крылья. "
    e "Дождавшись своего часа, паук вылез из своего укрытия и бесшумно добрался до своей жертвы, приготовившись впрыснуть в неё яд…. "

    e "Для пауков снов размер добычи не имеет значения."
    e "Благодаря своему яду снов, они могут спокойно поймать существо любого размера, даже если оно многократно крупнее их. "
    e "Маленькая Ведьма не пыталась вмешаться, "
    e "не пыталась помочь несчастной добыче паука снов {w=1}– это была жизнь, подчинённая безжалостному закону природы. "
    e "Сильнейший выживает за счёт более слабого {w=1}– так уж повелось, и не она это установила… "
    e "Маленькая Ведьма знала, что трепыхание в сети грёз должно привлечь паучиху, и настороженно искала её взглядом."


    e " Наконец, Маленькая Ведьма заметила её в тени большого сталагмита.  "
    e "Чёрная, покрытая похожими на стальную проволоку жёсткими торчащими волосками, паучиха приближалась к ней, "
    e "даже не обращая внимание на происходящее в паутине грёз. "
    e "И в этот момент Маленькую Ведьму прошиб холодный пот… "
    e "До неё дошло {w=1} – зевая по сторонам, "
    e "она из охотника превратилась в более желанную добычу, "
    e "чем застрявшая в паутине живность… "
  
    menu:
        "Отступить.":
            jump fast_end
            
        "Сражаться.":
            jump chapter3
            
    return