label chapter4fest:
    
    #$ Cha_04a = renpy.random.choice([1, 2])
    $ mci = rgen.rgen() 
    $ Cha_04a = mci

    if Cha_04a == 1:
    #if mci == 1:

        LW "- Там вдалеке определённо кто-то есть, "

        e "- сделала вывод Маленькая Ведьма, после чего ускорила шаг."

        e "Звуки, что манили её, были похожи на какую-то музыку… "
        e "Да, это была именно музыка. "
        e "Неведомый и чарующий мотив звучал как ритуальная музыка неизвестного ей народа, звуковое обрамление неизвестной ей традиции. "
        e "Мерный стук барабанов, звуки флейт и чего-то струнного. "
        e "Зацикленный кольцом ритм, повторявшийся с размеренным тактом. "
        e "После блужданий среди безлюдных улиц вымершего города, услышать здесь музыку казалось чем-то выходящим за грань реальности. "
        e "Маленькая ведьма шла на звуки, которые становились всё более отчётливыми."
        e "И всё более понятно, что это была не игра воображения. "
        e "Движимая любопытством, девочка вышла, достигнув проспекта."

        e "Он не был пуст!"

        e "От увиденного Маленькая Ведьма остановилась. "
        e "Проспект был более чем люден." 
        e "От столь вопиющего, неожиданного контраста, её первоначальное оцепенение усилилось, и она ощутила ватность в ногах. "
        e "Широкая улица была полна людей, которые мерно шли, все в одном направлении. "
        e "Эти люди были наряжены во всё чёрное:{w=1} в длинные балахоны с капюшонами, или же в не менее чёрные кимоно. "
        e "Их лица были закрыты масками {w=1}– иной раз белыми, иной раз цветастыми, на иных они напоминали рогатого демона, "
        e "или же просто лишённое всяких черт лицо."

        e "Неожиданно прогремел гром, раскатившись гулким эхом. "
        e "И редкие, крупные капли дождя стали падать, за мгновение проживая свою короткую жизнь длительностью в падение."

        LW "- Здравствуйте!"
        LW "- Вы откуда?"
        LW "- Вы куда путь держите?"

        e "Маленькая ведьма подбегала к шествовавшим, спрашивая. "
        e "Но ни от кого так и не добилась ответа. "
        e "Люди в чёрном шли молча, "
        e "образуя чинную и размеренную процессию под звуки, высекаемые музыкантами где-то впереди. "

        LW "- Куда я попала?.."

        Ananim "- Это Чёрный Фестиваль, дочка, "

        e "- ответила только одна женщина, одетая в чёрное кимоно с красным поясом оби. "
        e "Её лицо, как и лица всех остальных, скрывала белая фарфоровая маска."

        LW "- Чёрный Фестиваль?..{w=1} Я не слышала про такой…{w=1} И в честь чего он…"

        Ananim "- Чёрный Фестиваль проводится раз в течение годового цикла. "
        Ananim "Это фестиваль смерти."
        Ananim "Конца жизни, за которым всегда следует новое рождение. "

        LW "- Смерти?.."

        e "Маленькой ведьме стало не по себе. "
        e "От молчаливо шествовавших фигур, безликих фигур, закутанных во всё чёрное."
        e "От мерных звуков музыки, казавшихся теперь печальными и заунывными. "
        e "От всей этой процессии, среди тумана, посреди забытого всеми пустого города. "
        e "От самого этого ощущения некой предопределённости, безысходности, решённости,"
        e " во имя которого, безмолвно прославляя увядание и смерть, шли эти толпы. "
        e "Её сердце сжималось… "
        e "Маленькая Ведьма семенила быстрыми шагами, словно пытаясь приткнуться к кому-то. "
        e "Бежала вперёд, словно норовя обогнать фестиваль. "
        e "Но на деле – так же шла со всеми, "
        e "став невольным его участником. "
        e "Было темно, но многие участники несли с собой белые бумажные фонарики, все с одним каким-то иероглифом."

        LW "- А что этот символ значит? "

        e "Маленькая ведьма пыталась спросить у одного, другого, третьего безответного участника процессии. "
        e "Но они были глухи и немы."

        Ananim "- Это иероглиф смерти… "

        e "Это произнёс голос. "
        e "Вроде человеческий, но словно… "
        e "не такой. "
        e "Было в нём что-то абсолютно неправильное. "
        e "Нечто… {w=1}зловещее. "
        e "Маленькая ведьма повернулась, встретившись с фигурой в чёрном балахоне, "
        e "нет{w=1} – скорее платье {w=1}– но с таким же чёрным и надвинутым капюшоном, в белой с некоторыми красными деталями маске."
        e "Японской маске лисы, похожей на смеющийся смайлик. "
        e "Маски, у которой не было отверстий для глаз – они были лишь нарисованы двумя изогнутыми линиями. "

        LW "- Спа… {w=1}сибо…"

        e "Женщина отвернулась, продолжая свой путь."
        e "Было в ней что-то… "
        e "Несомненно грациозное. "
        e "Но это какая-то неправильная грация, пугающая и не из этого мира. "
        e "Её походка, не в такт и с малозаметными искажениями, словно она слабо прихрамывала, "
        e "а всё остальное тело колебалось в ответ, вела прямиком в зловещую долину. "
        e "Впечатление дополняли пальцы её рук, с длинными чёрными ногтями и перстнями,"
        e " выписывавшие какие-то незаметные знаки, значения которых девочка не понимала."

        e "Процессия продолжалась. "
        e "Маленькая ведьма шла вперёд, протискиваясь между рядов людей, нёсших белые фонари. "
        e "Ряды становились плотнее, а музыка – громче и отчётливее. "
        e "И вот {w=1}– она практически добралась до края, узрев главу всей процессии. "
        e "Странный высокий мужчина, с густой бородой и длинными, нечесаными волосами, в оборванной и грубой одежде, "
        e "с перемотанными грязными бинтами ладонями, нёс подобие христианского креста. "
        e "Подобие, отличавшееся тем, что кроме четырёх концов, из пересечения выходили ещё четыре острых луча, образовывавших Х. "

        e "Он провозглашал зычным голосом, сильным и глубоким. "
        e "Толпа повторяла за ним в единый многоголосый унисон:"

        nvl clear
        nvl show #dissolve

        nn "{color=#23a7e0}{i}Изгони навек воспоминания о мире иллюзий в ранней мгле.{/i}{/color}"
        nn "{color=#23a7e0}{i}Наш бренный мир стоит в ненадежном море из песка.{/i}{/color}"
        nn "{color=#23a7e0}{i}Выдуманный сон об истории древнего мира тайн сокровенных,{/i}{/color}"
        nn "{color=#23a7e0}{i}Ясный солнца свет воплотит на тонущих в бездне улицах,{/i}{/color}"
        nn "{color=#23a7e0}{i}Это фантазия, или хрупкий замок из песка?{/i}{/color}"
        nn "{color=#23a7e0}{i}До рассвета, этот сон – словно сон бабочки.{/i}{/color}"

        nvl clear
        window show

        e "Песнопение повторялось по второму, третьему кругу, становясь всё более неистовым и исступлённым. "
        e "Оно становилось чем-то похожим на мантру, даже на шаманское камлание. "
        e "Люди повторяли снова и снова, вгоняя себя в какое-то подобие транса, "
        e "и эти слова раздавались до самого конца процессии, проходя через всю толпу, как электрический ток проходит через провод."

        nvl clear
        nvl show #dissolve

        nn "{color=#23a7e0}{i}Изгони навек воспоминания о мире иллюзий в ранней мгле.{/i}{/color}"
        nn "{color=#23a7e0}{i}Наш бренный мир стоит в ненадежном море из песка.{/i}{/color}"
        nn "{color=#23a7e0}{i}Иже беззакония наши безмерны и вина наша тяжела,{/i}{/color}"
        nn "{color=#23a7e0}{i}В беззаконии и грехе рождённые,{/i}{/color}"
        nn "{color=#23a7e0}{i}Жаждущие Истины и Света,{/i}{/color}"
        nn "{color=#23a7e0}{i}Дай нам возрадоваться Искуплению...{/i}{/color}"

        nvl clear

        e "............"
        e "........."
        e "......"

        e "Небо прочертили молнии, редкие капли превратились в бодрый душ. "
        e "Душ {w=1}– в отвесную стену. "
        e "Народ, несмотря на проливной ливень, продолжал идти и скандировать, а музыка не затихала."

        centered "{i}Эти люди… Они едины в своей цели.Вера, религия… Я всегда считала религию самообманом. Всякую религию. Но… Как говорила Хранительница Миров, разум не может существовать без самообмана. Разум – он всегда ограничен, каков бы велик он ни был – разум всегда встречает стену.  {/i}"
        centered "{i}Предел, который ему не преодолеть. Вещи, которые ему никогда не познать. Он жаждет – и не может, как приговорённый к вечным мукам Тантал. Вечной жажде и вечному голоду, которых ему не утолить никогда. Только он протягивает руки к воде – вода уходит, протягивает руки в ветке с фруктами – и фрукты обращаются в прах. {/i}"
        centered "{i}Так и разум – он не в силах сделать последний шаг, не в силах переступить через грань, и увидеть – что же за ней. Обычно, этой гранью является смерть. Ум жаждет, и не в силах ощутить, он вынужден создавать симулякры. Всё просто. {/i}"
        centered "{i}Это нельзя запретить, нельзя преодолеть, нельзя изгнать из разума – это его неотъемлемая часть… И эта процессия. Шествие во имя смерти. Культ смерти, хождение по лезвию… Губы соскучились по пряному вину… {/i}"

        e "Процессия достигла площади, где остановилась. "
        e "Смолкло пение, смолкла музыка. "
        e "Оставался только нетерпеливый шёпот среди общего напряжения. "
        e "Все ждали чего-то важного, чего-то решающего. "
        e "Кульминации празднества."

        e "Маленькая ведьма ощутила мягкое прикосновение руки к своему плечу. "
        e "Обернувшись, она увидела ту самую женщину в причудливой, старинной маске лисы. "
        e "Маске, на которой, обратила она внимание, глаза были нарисованы… "
        e "Но как же она видит? "
        e "Она не производила впечатление слепой. "

        LW "- Вы?"

        e "Удивлённо спросила Маленькая ведьма, глядя на эту женщину со странной, грациозной, но неестественной походкой. "

        Shu "- Я Мара."

        e "Девочки показалась что-то знакомым это имя. "
        e "Она уже слышала его раньше:"

        LW "«Но где?» "

        e "Странная женщина глядит сквозь Маленькую Ведьму, затягивая в себя своим взглядом. "
        e "Хотя каким взглядом, если глаза сквозь маску должны не видеть ничего?.. "
        e "Это было самым необычным в ней, самым загадочным и пугающим."

        Shu "- Ты странная."

        e "Произнесла женщина, и опять девочка услышала этот голос. "
        e "Вроде человеческий, но какой-то… неправильный, если одним словом."

        LW "- И чем же я странная?"

        Shu "- Дождь… {w=1}Ты странно к нему относишься. "
        Shu "Не как все остальные. "
        Shu "Будто он не влияет на тебя."

        LW "- И как я должна относиться к дождю?"

        Shu "- Этот человек в данный момент идет к своей голгофе, совершает ритуал. "
        Shu "Он откажется от своей идентичности, став тенью. "
        Shu "Войдя в анонимный легион, став частью его, как капля становится частью лужи,"
        Shu " лужа – частью ручья, ручей – частью реки, река – частью моря, а море вливается в безбрежный океан."

        LW "- И что ему для этого нужно совершить?"

        Shu "- Слиться с дождём и туманом. "
        Shu "Там, где кончается реальность."

        e "Диалог прервал удар колокола. "
        e "Мерный, подобный башенным часам. "
        e "Или это они и были."

        LW "- И где она кончается?"

        e "Женщина в маске усмехнулась своим неправильным, неестественным смехом. "
        e "Улыбка лисьей маски в этот момент выглядела особенно зловещей."

        Shu "- Есть вещи, которые трудно сказать словами. "
        Shu "Есть вещи, которые нужно показать."

        LW "- Показать?"

        Shu "- Я поведаю тебе его историю. "
        Shu "Только закрой глаза. "
        Shu "Закрой – и откройся. "
        Shu "Ты не должна сопротивляться, твой разум не дожжен противиться."

        LW "- А это?.."

        Shu "- Ты боишься.{w=1} Сомневаешься.{w=1} Я всего лишь приоткрою перед тобой дверь. "
        Shu "На узкую щёлку – достаточную для одного глаза. "
        Shu "Ты должна это ощутить."

        e "Маленькая ведьма колебалась, думая – стоит ли верить этой женщине. "
        e "На какое-то мгновение она закрыла глаза…"

        LW "- И что дальше?" 

        e "Она не успела получить ответа, как почувствовала руку на своей голове… "
        e "Удар…"

        e "..............."
        e ".........."
        e "......"

        e "Некоторое время не было ничего. "
        e "Ни ощущений, ни даже тьмы. "
        e "Потом она поняла, что видит. "
        e "Не себя, и от третьего лица. "

        e "Человек стоял на крыше какого-то дома. "
        e "Мужчина."
        e "Одетый в чёрный мотоциклетный комбинезон, с чёрными короткими волосами. "
        e "Он стоял и смотрел, видя перед собой впереди улицу и площадь, полных людей. "
        e "В небе полыхало кровавое зарево, на земле внизу полыхали огромные костры и горели кучи чего-то, "
        e "поднимая столбы пламени и изрыгая глубы густого, чёрного дыма. "
        e "Это было слишком далеко и непонятно, чтобы разглядеть происходящее,"
        e " мельтешащих людей, у некоторых из которых было нечто вроде транспарантов и флагов. "
        e "Это копошение муравьёв, которое сверху и издалека было слабо различимым, "
        e "сопровождалось доносившимися, приглушёнными расстоянием, но отчётливыми звуками {w=1}– сирен, выстрелов и взрывов… "
        e "Это были беспорядки? "
        e "Бунт? "
        e "Бой?.. "
        e "Уж точно не мирное шествие."

        e "Человек стоял, наблюдая за происходящим, стоя лицом к площади. "
        e "Ведьма была не им {w=1}– она была зрителем. "
        e "Неведомой и невидимой виртуальной камерой, закреплённой за его спиной."
        e "Видевшей – но не ощущавшей ничего, не чувствовавшей тела. "
        e "Она не видела его лица – только тонкий дымок сигареты, которую он курил."

        e "Израсходованный окурок полетел вниз, с крыши. "
        e "Человек обернулся – его лицо было знакомо."
        e "Это же тот, который шёл с крестом. "
        e "Только он был моложе, и совершенно безбородый. "
        e "Но совершенно измождённый и осунувшийся, судя по его лицу."

        men "- Вот и мой настал час уходить. "
        men "Я здесь лишний."

        e "Мужчина проговорил это мерным, спокойным голосом. "
        e "Полным смирения со своей судьбой и с чем-то неизвестным, бывшим выше и сильнее всех его устремлений. "
        e "Его порывы были подавлены осознанием."
        e "Он лишь шептал…"

        men "- Он ведь апостол, а я остолоп… "
        men "Хотел я набрать бледно-розовых яблок… "
        men "Но сад сторожат – и стреляют без промаха в лоб…"

        e "На улице раздавался шум боя, выстрелы звучали громче и громче, сливаясь в неистовую какофонию огня."

        men "- Как ржанёт коренной, я смирил его ласковым словом… "
        men "Да репьи из мочал еле выдрал, и гриву заплёл..."

        e ".........."
        e "......"
        e "..."

        e "Продолжая нелепую бессмыслицу, он подошёл к люку, что вёл на крышу, и спустился по лестнице, оказавшись в подъезде. "
        e "Квартирные двери на площадках, сплошь исписанные граффити и просто надписями стены… "
        e "Он спускался вниз, этажей всего девять… "
        e "Дверь подъезда легко поддалась, у входа стоял мотоцикл."

        men "- И погнал я коней прочь от мест этих гиблых и зяблых…"

        e "Одев висевший на ручке руля шлем, мужчина сел. "
        e "Техника быстро завелась…"

        e "Он ехал… "
        e "Городские улицы, потрёпанные и замусоренные, с разбитыми витринами магазинов и следами погромов… "
        e "Где-то горел БТР… "
        e "Город вскоре сменился одной большой, бесконечной трассой"
        e "Трассой, которая вела куда-то в дальнюю даль, и не было ей конца."
        e "Мотоцикл ехал вперёд, освещая путь своим передним фонарём…"
        e "Путь окутал туман, непроглядная, почти жидкая водяная взвесь. "
        e "В тумане мерещились сгустки, какие-то существа или сущности… "

        LW "- Что это? "

        e "Спрашивала Маленькая Ведьма. "
        e "У неё не было тела, лишь взор {w=1}– но она как-то могла говорить."

        Shu "- Смотри. {w=1}Смотри дальше… "

        e "Отвечал всё тот же голос неизвестной в маске лисицы."

        e "Сквозь шум мотора стал слышен другой шум. "
        e "Шум моря. "
        e  "Туман расступился, на чёрном небе сияли всполохи молний. "
        e "Он подъехал к скальному берегу, остановившись."
        e "Он встал с мотоцикла, подойдя к краю. "
        e "Под высоким обрывом бушевал шторм, и яркие всполохи света исходили из самой воды. "
        e "Что-то поднималось… "
        e "Что-то огромное, невообразимое… "
        e "Ведьма в страхе ожидала увидеть что угодно {w=1}– дракона, клешни, щупальца…"
        e "Но это была… "
        e "Сама тьма, концентрированная и густая, подобная сверхплотной плазме."
        e "Эта плазма образовывала ком –{w=1} или тело, из которого протуберанцами вырывались шеи и головы существа,"
        e " такие же тёмные, со словно нарисованными и вставленными пастями и огненными красными глазами."

        men "- И стал я на песке морском, и увидел выходящего из моря зверя с семью головами и десятью рогами: "
        men "на рогах его было десять диадем, а на головах его имена богохульные…"

        e "Произнёс человек, стоявший у края."

        e "Из вершин раздался звук."
        e "Его нельзя было назвать голосом, ибо к человеческим голосам, равно как и к любому звуку земной природы он не имел отношения. "
        e "Гулко-пронзительный и растянуто-бесформенный, громкий как гром, как старт ракеты... "
        e "Слова звучали не так, как говорят люди, с беспорядочно-ломанными интервалами."

        monster "- ЧТот…{w=1} Тыы..{w=1} ХоЧешшшь? {w=1}Смерт… нЫЙ!.."

        men "- Покоя…"

        e "Робко проговорил мотоциклист, дрожавший перед лицом невообразимого чудовища."

        monster "- ТЫ НАЙДЁШЬ ПОКОЙ, ОТКАЗАВШИСЬ ОТ СВОЕЙ ИНДИВИДУАЛЬНОСТИ… {w=1}ОТКАЗАВШИСЬ ОТ СЕБЯ,"
        monster " ОТ ЛИЧНОСТИ, ОТ ВСЕГО ПОРОЖДАЮЩЕГО СТРАДАНИЯ…{w=1} ОТКАЖИСЬ… ОСВОБОДИ СЕБЯ…"

        men "- Что я должен сделать?.."

        monster "- ПРЫГНУТЬ… {w=1}ПРЫГНУТЬ ВНИЗ, СО СКАЛЫ… {w=1}РЕШИСЬ…"

        e "Человек стоял, в ужасе и растерянности, не зная, какой совершить дальнейший шаг. "
        e "Чудовище возвышалось как гора, на сотни метров. "
        e "Может – {w=1}тысячи…"

        LW "- Не делай этого!"

        Shu "- Не мешай!"

        e "Ответил ведьме голос женщины в маске лисицы…"
        
        e "Он разбежался – и прыгнул.{w=1} Молча…"
        e "Мир стал меркнуть. "

        e "..........."
        e "........"
        e "...."

        e "Вновь наступила тьма, пропало всё…"

        e "Маленькая ведьма осознала себя стоящей на пустой площади города. "
        e "Пустой, кроме неё и женщины в маске."

        Shu "- И вот, наконец, он оказался в городе дождя и тумана. "

        e "– Произнесла женщина."

        Shu "– Понял, что именно этого он вес свой путь и желал. "
        Shu "Это общество без лиц и без имен. "
        Shu "Здесь нет различий и нет индивидуальности. "
        Shu "Нет жизни и смерти. "

        LW "- Как это? "

        e "– Искренье спросила Маленькая ведьма. "

        LW "– У каждого есть различия. "
        LW "Не бывает так, чтобы все были похожи друг на друга! "
        LW "Так этот город… "
        LW "Город мёртвых?!!"

        Shu "- Вижу, что ты стала прозревать. "
        Shu "Это город теней, его населяют призраки. "
        Shu "Они не видны обычному взору, только открывший своё сердце в силах узреть. "

        e "- Женщина рассмеялась."

        Shu "— Так ты и, правда, не отсюда!"

        e "– Произнесла Женщина. "

        Shu "— Я думала, ты очередная свихнувшаяся тень?"

        LW "— Тень!? "

        e "– Удивленно переспросила Ведьмочка."

        Shu "— Тени.{w=1} Люди в этом городе. "
        Shu "Люди в этом городе, представляющих собой бессознательную часть психики и совокупность инстинктивных влечений и желаний, "
        Shu "порождаемые воспоминаниями. "
        Shu "Я думала, ты возомнила себя личностью, будто бы забыв свой дождь."
        Shu "Иногда так бывает, но Город обычно быстро ставит всех на свои места."

        e "Густой туман становился непроходимым, через него не было видно даже в метре."

        LW "- Этот туман… {w=1}Я ничего не вижу…"

        Shu "- Пойдём!"

        e "Маленькая ведьма пошла… "
        e "Вскоре поняв, что это не город. "
        e "Она стояла на берегу моря."
        e "Спокойного, более не бурного. "
        e "На пляже из камней крупной гальки, обточенной волнами за многие века прибоев. "
        e "Пляж был в глубокой дымке, закутанный туманом."
        e "Как и вода. "
        e "Стоял почти что полный штиль. "
        e "Вдалеке было что-то… "
        e "Какие-то огромные щупальца, поднимавшиеся из воды на километры, медленно шевелившиеся."

        LW "- Что это за…"

        Shu "- Не бойся, девочка – нам они не угрожают. "
        Shu "Тебе со мной, по крайней мере."

        LW "- Откуда они?"

        Shu "- Это древнее хтоническое существо, воплощение разума океана. "
        Shu "Я сильнее, а оно не пойдёт против большей силы."

        LW "- Большей силы?"

        e "Женщина в маске только усмехнулась{w=1} – и на какое-то мгновение, раздвинув руки в стороны в позе распятия, зависла над берегом. "
        e "Её босые стопы с чёрными, острыми ногтями, парили над галькой в воздухе. "
        e "Она левитировала."

        Shu "- Ты ведь тоже так можешь?"

        LW "- Вовсе нет…"

        Shu "- Ты же ведьма!"

        LW "- Но я не…"

        e "Маленькая ведьма не нашла что сказать."
        e "Как ни странно, её спутница тоже замолчала."
        e "Некоторое время они шли. "
        e "Молча шли."
        e "Ходить по этим крупным камням было тяжело,"
        e "даже в ботинках – и тем более удивительным выглядело то, как эта в маске шла босая впереди, заставляя ведьму едва поспевать за ней."

        LW "- Куда мы идём? "

        e "Но ответа не получила."

        e "Маленькая ведьма продолжила брести дальше. "
        e "Наконец, она увидела лестницу среди красных скал, которая вела вверх, на подъём."
        e "Сверху раздался тяжёлый гул и гудок уносящегося поезда."

        LW "- Так она… {w=1}Где ты?!"

        e "Но женщина исчезла, словно её и не было. "

        e "Её лицо синее неба, глаза желты как лис, в ночи растут тут призрачные тени и нет покоя в самой чаще леса ей. "
        e "Маленькая ведьма принялась подниматься по лестнице, оставляя позади пляж, море и щупальца вдали..."

        e "******************************************"




        pass

    elif Cha_04a == 2:
    #elif mci >= 2:
        #block of code to run

        LW "- Там вдалеке определённо кто-то есть."

        e "Подумала Маленькая ведьма, пойдя в сторону проспекта, откуда раздавались манившие её звуки. "
        e "Они были похожи на какую-то музыку… "
        e "Да, это была именно музыка, неведомый и чарующий мотив, принадлежавший неизвестным ей исполнителям. "
        e "Она звучала как ритуальная музыка неизвестного ей народа, звуковое обрамление неизвестной ей традиции. "
        e "Мерный стук барабанов, звуки флейт и чего-то струнного. "
        e "Зацикленный кольцом ритм, повторявшийся с размеренным тактом. "
        e "После блужданий среди безлюдных улиц вымершего города, "
        e "услышать здесь музыку казалось чем-то невероятно-магическим, выходящим за грань реальности." 
        e "Даже пугающим."
        e "Маленькая ведьма шла на звуки, которые становились всё более отчётливыми. "
        e "И всё более понятно, что это была не игра воображения. "
        e "Движимая любопытством, девочка вышла, достигнув проспекта."

        e "Он не был пуст!"

        e "От увиденного она остановилась. "
        e "Проспект был более чем люден. "
        e "От столь вопиющего, неожиданного контраста, её первоначальное оцепенение усилилось, доходя до лёгкой дрожи в ногах. "
        e "Широкая улица была полна людей, которые мерно шли все в одном направлении. "
        e "Одетые во всё чёрное, в длинные балахоны с капюшонами, или же в не менее чёрные кимоно. "
        e "Их лица были закрыты масками, иной раз белыми, иной раз цветастыми, "
        e "на иных они напоминали рогатого демона, или же просто лишённое всяких черт лицо."

        e "Прогремел гром, раскатившись гулким эхом. "
        e "И редкие, крупные капли дождя стали падать, за мгновение проживая свою короткую жизнь длительностью в падение."

        LW "- Здравствуйте!"
        LW "- Вы откуда?"
        LW "- Вы куда путь держите?"

        e "Маленькая ведьма подбегала к шествовавшим, спрашивая. "
        e "Но, ни от кого так и не добилась ответа."
        e "Люди в чёрном молча, шли, составляя чинную и размеренную процессию под звуки, высекаемые музыкантами где-то впереди. "

        LW "- Куда я попала?.."

        Ananim "- Это Чёрный Фестиваль, дочка, "

        e "- ответила только одна женщина, одетая в чёрное кимоно с красным поясом оби. "

        e "Её лицо, как и лица всех остальных, скрывала белая фарфоровая маска."

        LW "- Чёрный Фестиваль?.. {w=1}Я не слышала про такой… {w=1}И в честь чего он…"

        Ananim "- Чёрный Фестиваль проводится раз в течение годового цикла. "
        Ananim "Это фестиваль смерти. "
        Ananim "Конца жизни, за которым всегда следует новое рождение. "

        LW "- Смерти?.."

        e "Маленькой ведьме стало не по себе."
        e "От молчаливо шествовавших фигур, безликих фигур, закутанных во всё чёрное. "
        e "От мерных звуков музыки, казавшихся теперь печальными и заунывными. "
        e "От всей этой процессии, среди тумана, посреди забытого всеми пустого города. "
        e "От самого этого ощущения некой предопределённости, безысходности, решённости, "
        e "во имя которого, безмолвно прославляя увядание и смерть, шли эти толпы. "
        e "Её сердце сжималось… "
        e "Маленькая ведьма семенила быстрыми шагами, словно пытаясь приткнуться к кому-то. "
        e "Бежала вперёд, словно норовя обогнать фестиваль. "
        e "Но на деле – так же шла со всеми, став невольным его участником. "
        e "Было темно, но многие участники несли с собой белые бумажные фонарики, все с одним каким-то иероглифом."

        LW "- А что этот символ значит? "

        e "Маленькая ведьма пыталась спросить у одного, другого, третьего безответного участника процессии. "
        e "Но они были глухи и немы."

        Ananim "- Это иероглиф смерти… "

        e "Это произнёс голос. "
        e "Вроде человеческий, но словно… {w=1}не такой. "
        e "Было в нём что-то абсолютно неправильное."
        e " Нечто…{w=1} зловещее. "
        e "Маленькая ведьма повернулась, встретившись с фигурой в чёрном балахоне, "
        e "нет {w=1}– скорее платье {w=1}– но с таким же чёрным и надвинутым капюшоном,"
        e " в белой с некоторыми красными деталями маске. "
        e "Японской маске лисы, похожей на смеющийся смайлик. "
        e "Маски, у которой не было отверстий для глаз{w=1} – они были лишь нарисованы двумя изогнутыми линиями. "

        LW "- Спа…{w=1} сибо…"

        e "Женщина отвернулась, продолжая свой путь. "
        e "Было в ней что-то… "
        e "Несомненно грациозное. "
        e "Но это какая-то неправильная грация, пугающая и не из этого мира. "
        e "Её походка, не в такт и с малозаметными искажениями, "
        e "словно она слабо прихрамывала, а всё остальное тело колебалось в ответ, вела прямиком в зловещую долину. "
        e "Впечатление дополняли пальцы её рук, с длинными чёрными ногтями и перстнями, "
        e "выписывавшие какие-то незаметные знаки, значения которых девочка не понимала."

        e "Процессия продолжалась. "
        e "Маленькая ведьма шла вперёд, протискиваясь между рядов людей, нёсших белые фонари. "
        e "Ряды становились плотнее, а музыка – громче и отчётливее. "
        e "И вот {w=1}– она практически добралась до края, узрев главу всей процессии. "

        e "Странный высокий мужчина, с густой бородой и длинными, нечесаными волосами, "
        e "в оборванной и грубой одежде, с перемотанными грязными бинтами ладонями, нёс подобие христианского креста. "
        e "Подобие, отличавшееся тем, что кроме четырёх концов, из пересечения выходили ещё четыре острых луча, образовывавших Х. "

        e "Он провозглашал зычным голосом, сильным и глубоким. "
        e "Толпа повторяла за ним в единый многоголосый унисон:"

        nvl clear
        nvl show #dissolve

        "{color=#23a7e0}{i}Изгони навек воспоминания о мире иллюзий в ранней мгле.{/i}{/color}"
        "{color=#23a7e0}{i}Наш бренный мир стоит в ненадежном море из песка.{/i}{/color}"
        "{color=#23a7e0}{i}Выдуманный сон об истории древнего мира тайн сокровенных,{/i}{/color}"
        "{color=#23a7e0}{i}Ясный солнца свет воплотит на тонущих в бездне улицах,{/i}{/color}"
        "{color=#23a7e0}{i}Это фантазия, или хрупкий замок из песка?{/i}{/color}"
        "{color=#23a7e0}{i}До рассвета, этот сон – словно сон бабочки.{/i}{/color}"

        nvl clear
        window show

        e "Песнопение повторялось по второму, третьему кругу, становясь всё более неистовым и исступлённым. "
        e "Оно становилось чем-то похожим на мантру, даже на шаманское камлание. "
        e "Люди повторяли снова и снова, вгоняя себя в какое-то подобие транса, "
        e " и эти слова раздавались до самого конца процессии, проходя через всю толпу,"
        e " как электрический ток проходит через провод."

        nvl clear
        nvl show #dissolve

        "{color=#23a7e0}{i}Изгони навек воспоминания о мире иллюзий в ранней мгле.{/i}{/color}"
        "{color=#23a7e0}{i}Наш бренный мир стоит в ненадежном море из песка.{/i}{/color}"
        "{color=#23a7e0}{i}Иже беззакония наши безмерны и вина наша тяжела,{/i}{/color}"
        "{color=#23a7e0}{i}В беззаконии и грехе рождённые,{/i}{/color}"
        "{color=#23a7e0}{i}Жаждущие Истины и Света,{/i}{/color}"
        "{color=#23a7e0}{i}Дай нам возрадоваться Искуплению...{/i}{/color}"

        nvl clear

        e "............"
        e "........."
        e "......"

        e "Небо прочертили молнии, редкие капли превратились в бодрый душ. "
        e "Душ {w=1}– в отвесную стену. "
        e "Народ, несмотря на проливной ливень, продолжал идти и скандировать, а музыка не затихала."

        LW "{i}- Эти люди…{w=1} Они едины в своей цели. {/i}"
        LW "{i}Они едины в своей вере.{/i}"
        LW "{i}Вера, религия… {w=1}Я всегда считала религию самообманом.{/i} "
        LW "{i}Всякую религию. {/i}"
        LW "{i}Но… Как говорила Хранительница Миров, разум не может существовать без самообмана. {/i}"
        LW "{i}Разум – он всегда ограничен, каков бы велик он ни был – разум всегда встречает стену. {/i}"
        LW "{i}Предел, который ему не преодолеть. {/i}"
        LW "{i}Вещи, которые ему никогда не познать. {/i}"
        LW "{i}Он жаждет – и не может, как приговорённый к вечным мукам Тантал. {/i}"
        LW "{i}Вечной жажде и вечному голоду, которых ему не утолить никогда. {/i}"
        LW "{i}Только он протягивает руки к воде – вода уходит, протягивает руки в ветке с фруктами – и фрукты обращаются в прах. {/i}"
        LW "{i}Так и разум – он не в силах сделать последний шаг, не в силах переступить через грань, и увидеть – что же за ней. {/i}"
        LW "{i}Обычно, этой гранью является смерть.{/i}"
        LW "{i} Ум жаждет, и не в силах ощутить, он вынужден создавать симулякры. {/i}"
        LW "{i}Всё просто. {/i}"
        LW "{i}Это нельзя запретить, нельзя преодолеть, нельзя изгнать из разума – это его неотъемлемая часть…{/i}"
        LW "{i} И эта процессия. {/i}"
        LW "{i}Шествие во имя смерти.{/i}"
        LW "{i}Культ смерти, хождение по лезвию…{/i}"
        LW "{i}Губы соскучились по пряному вину… {/i}"

        e "Процессия достигла площади, где остановилась. "
        e "Смолкло пение, смолкла музыка."
        e "Оставался только нетерпеливый шёпот среди общего напряжения."
        e "Все ждали чего-то важного, чего-то решающего. "
        e "Кульминации празднества."

        e "Маленькая ведьма ощутила мягкое прикосновение руки к своему плечу. "
        e "Обернувшись, она увидела ту самую женщину в причудливой, старинной маске лисы."
        e "Маске, на которой, обратила она внимание, глаза были нарисованы… "
        e "Но как же она видит? "
        e "Она не производила впечатление слепой. "

        LW "- Вы?"

        e "Удивлённо спросила Маленькая ведьма, глядя на эту женщину со странной, грациозной, но неестественной походкой. "

        Shu "- Я Мара."

        e "Девочки показалась что-то знакомым это имя. Она уже слышала его раньше:"

        LW "«Но где?» "

        e "Странная женщина глядит сквозь Маленькую Ведьму, затягивая в себя своим взглядом. "
        e "Хотя каким взглядом, если глаза сквозь маску должны не видеть ничего?.. "
        e "Это было самым необычным в ней, самым загадочным и пугающим."

        Shu "- Ты странная."

        e "Произнесла женщина, и опять девочка услышала этот голос. "
        e "Вроде человеческий, но какой-то… {w=1}неправильный, если одним словом."

        LW "- И чем же я странная?"

        Shu "- Дождь…{w=1} Ты странно к нему относишься. "
        Shu "Не как все остальные. "
        Shu ". Будто он не влияет на тебя."

        LW "- И как я должна относиться к дождю?"

        Shu "- Этот человек в данный момент идет к своей голгофе, совершает ритуал. "
        Shu "Он откажется от своей идентичности, став тенью. "
        Shu "Войдя в анонимный легион, став частью его, как капля становится частью лужи,"
        Shu " лужа – частью ручья, ручей – частью реки, река – частью моря, а море вливается в безбрежный океан."

        LW "- И что ему для этого нужно совершить?"

        Shu "- Слиться с дождём и туманом. "
        Shu "Там, где кончается реальность."

        e "Диалог прервал удар колокола. "
        e "Мерный, подобный башенным часам. "
        e "Или это они и были."

        LW "- И где она кончается?"

        e "Женщина в маске усмехнулась своим неправильным, неестественным смехом. "
        e "Улыбка лисьей маски в этот момент выглядела особенно зловещей."

        Shu "- Есть вещи, которые трудно сказать словами. "
        Shu "Есть вещи, которые нужно показать."

        LW "- Показать?"

        Shu "- Я поведаю тебе его историю. "
        Shu "Только закрой глаза. "
        Shu "Закрой – и откройся. "
        Shu "Ты не должна сопротивляться, твой разум не дожжен противиться."

        LW "- А это?.."

        Shu "- Ты боишься.{w=1} Сомневаешься.{w=1} Я всего лишь приоткрою перед тобой дверь. "
        Shu "На узкую щёлку – достаточную для одного глаза. "
        Shu "Ты должна это ощутить."

        e "Маленькая ведьма колебалась, думая – стоит ли верить этой женщине. "
        e "На какое-то мгновение она закрыла глаза…"

        LW "- И что дальше?" 

        e "Она не успела получить ответа, как почувствовала руку на своей голове… "
        e "Удар…"

        e "..............."
        e ".........."
        e "......"

        e "Некоторое время не было ничего."
        e "Ни ощущений, ни даже тьмы. "
        e "Потом она поняла, что видит."
        e "Не себя, и от третьего лица. "

        e "Человек стоял на крыше какого-то дома. "
        e "Мужчина."
        e "Одетый в чёрный мотоциклетный комбинезон, с чёрными короткими волосами. "
        e "Он стоял и смотрел, видя перед собой впереди улицу и площадь, полных людей. "
        e "В небе полыхало кровавое зарево, на земле внизу полыхали огромные костры и горели кучи чего-то,"
        e " поднимая столбы пламени и изрыгая глубы густого, чёрного дыма."
        e "Это было слишком далеко и непонятно, чтобы разглядеть происходящее, мельтешащих людей, "
        e "у некоторых из которых было нечто вроде транспарантов и флагов. "
        e "Это копошение муравьёв, которое сверху и издалека было слабо различимым, "
        e "сопровождалось доносившимися, приглушёнными расстоянием, но отчётливыми звуками – сирен, выстрелов и взрывов… "
        e "Это были беспорядки? "
        e "Бунт?"
        e "Бой?.. "
        e "Уж точно не мирное шествие."

        e "Человек стоял, наблюдая за происходящим, стоя лицом к площади. "
        e "Ведьма была не им{w=1} – она была зрителем. "
        e "Неведомой и невидимой виртуальной камерой, закреплённой за его спиной. "
        e "Видевшей – но не ощущавшей ничего, не чувствовавшей тела. "
        e "Она не видела его лица{w=1} – только тонкий дымок сигареты, которую он курил."

        e "Израсходованный окурок полетел вниз, с крыши. "
        e "Человек обернулся{w=1} – его лицо было знакомо."
        e "Это же тот, который шёл с крестом. "
        e "Только он был моложе, и совершенно безбородый. "
        e "Но совершенно измождённый и осунувшийся, судя по его лицу."

        men "- Вот и мой настал час уходить. "
        men "Я здесь лишний."

        e "Мужчина проговорил это мерным, спокойным голосом. "
        e "Полным смирения со своей судьбой и с чем-то неизвестным, бывшим выше и сильнее всех его устремлений. "
        e "Его порывы были подавлены осознанием."
        e "Он лишь шептал…"

        men "- Он ведь апостол, а я остолоп… "
        men "Хотел я набрать бледно-розовых яблок… "
        men "Но сад сторожат – и стреляют без промаха в лоб…"

        e "На улице раздавался шум боя, выстрелы звучали громче и громче, сливаясь в неистовую какофонию огня."

        men "- Как ржанёт коренной, я смирил его ласковым словом… "
        men "Да репьи из мочал еле выдрал, и гриву заплёл..."

        e ".........."
        e "......"
        e "..."

        e "Продолжая нелепую бессмыслицу, он подошёл к люку, что вёл на крышу,"
        e " и спустился по лестнице, оказавшись в подъезде."
        e "Квартирные двери на площадках, сплошь исписанные граффити и просто надписями стены… "
        e "Он спускался вниз, этажей всего девять…"
        e "Дверь подъезда легко поддалась, у входа стоял мотоцикл."

        men "- И погнал я коней прочь от мест этих гиблых и зяблых…"

        e "Одев висевший на ручке руля шлем, мужчина сел. "
        e "Техника быстро завелась…"

        e "Он ехал… "
        e "Городские улицы, потрёпанные и замусоренные, с разбитыми витринами магазинов и следами погромов… "
        e "Где-то горел БТР… "
        e "Город вскоре сменился одной большой, бесконечной трассой. "
        e "Трассой, которая вела куда-то в дальнюю даль, и не было ей конца."
        e "Мотоцикл ехал вперёд, освещая путь своим передним фонарём… "
        e "Путь окутал туман, непроглядная, почти жидкая водяная взвесь. "
        e "В тумане мерещились сгустки, какие-то существа или сущности… "

        LW "- Что это? "

        e "Спрашивала Маленькая Ведьма. "
        e "У неё не было тела, лишь взор {w=1}– но она как-то могла говорить."

        Shu "- Смотри. {w=1}Смотри дальше… "

        e "Отвечал всё тот же голос неизвестной в маске лисицы."

        e "Сквозь шум мотора стал слышен другой шум. "
        e "Шум моря. "
        e  "Туман расступился, на чёрном небе сияли всполохи молний. "
        e "Он подъехал к скальному берегу, остановившись."
        e "Он встал с мотоцикла, подойдя к краю. "
        e "Под высоким обрывом бушевал шторм, и яркие всполохи света исходили из самой воды. "
        e "Что-то поднималось… "
        e "Что-то огромное, невообразимое… "
        e "Ведьма в страхе ожидала увидеть что угодно {w=1}– дракона, клешни, щупальца…"
        e "Но это была… "
        e "Сама тьма, концентрированная и густая, подобная сверхплотной плазме."
        e "Эта плазма образовывала ком –{w=1} или тело, из которого протуберанцами вырывались шеи и головы существа,"
        e " такие же тёмные, со словно нарисованными и вставленными пастями и огненными красными глазами."

        men "- И стал я на песке морском, и увидел выходящего из моря зверя с семью головами и десятью рогами: "
        men "на рогах его было десять диадем, а на головах его имена богохульные…"

        e "Произнёс человек, стоявший у края."

        e "Из вершин раздался звук."
        e "Его нельзя было назвать голосом, ибо к человеческим голосам, равно как и к любому звуку земной природы он не имел отношения. "
        e "Гулко-пронзительный и растянуто-бесформенный, громкий как гром, как старт ракеты... "
        e "Слова звучали не так, как говорят люди, с беспорядочно-ломанными интервалами."

        monster "- ЧТот…{w=1} Тыы..{w=1} ХоЧешшшь? {w=1}Смерт… нЫЙ!.."

        men "- Покоя…"

        e "Робко проговорил мотоциклист, дрожавший перед лицом невообразимого чудовища."

        monster "- ТЫ НАЙДЁШЬ ПОКОЙ, ОТКАЗАВШИСЬ ОТ СВОЕЙ ИНДИВИДУАЛЬНОСТИ… {w=1}ОТКАЗАВШИСЬ ОТ СЕБЯ,"
        monster " ОТ ЛИЧНОСТИ, ОТ ВСЕГО ПОРОЖДАЮЩЕГО СТРАДАНИЯ…{w=1} ОТКАЖИСЬ… ОСВОБОДИ СЕБЯ…"

        men "- Что я должен сделать?.."

        monster "- ПРЫГНУТЬ… {w=1}ПРЫГНУТЬ ВНИЗ, СО СКАЛЫ… {w=1}РЕШИСЬ…"

        e "Человек стоял, в ужасе и растерянности, не зная, какой совершить дальнейший шаг. "
        e "Чудовище возвышалось как гора, на сотни метров. "
        e "Может – {w=1}тысячи…"

        LW "- Не делай этого!"

        Shu "- Не мешай!"

        e "Ответил ведьме голос женщины в маске лисицы…"
        
        e "Он разбежался – и прыгнул.{w=1} Молча…"
        e "Мир стал меркнуть. "

        e "..........."
        e "........"
        e "...."

        e "Маленькая ведьма осознала себя стоящей на пустой площади города. "
        e "Пустой, кроме неё и женщины в маске."

        Shu "- И вот, наконец, он оказался в городе дождя и тумана. "

        e "– Произнесла женщина."

        Shu "– Понял, что именно этого он вес свой путь и желал. "
        Shu "Это общество без лиц и без имен. "
        Shu "Здесь нет различий и нет индивидуальности. "
        Shu "Нет жизни и смерти. "

        LW "- Как это? "

        e "– Искренье спросила Маленькая ведьма. "

        LW "– У каждого есть различия. "
        LW "Не бывает так, чтобы все были похожи друг на друга! "
        LW "Так этот город… "
        LW "Город мёртвых?!!"

<<<<<<< HEAD
        
=======
        Shu "- Вижу, что ты стала прозревать. "
        Shu "Это город теней, его населяют призраки. "
        Shu "Они не видны обычному взору, только открывший своё сердце в силах узреть. "

        e "Женщина рассмеялась."

        Shu "— Так ты и, правда, не отсюда!"

        e "– Произнесла Женщина. "

        Shu "— Я думала, ты очередная свихнувшаяся тень?"

        LW "— Тень!? "

        e "– Удивленно переспросила Ведьмочка."

        Shu "— Тени.{w=1} Люди в этом городе. "
        Shu "Люди в этом городе, представляющих собой бессознательную часть психики и совокупность инстинктивных влечений и желаний, "
        Shu "порождаемые воспоминаниями. "
        Shu "Я думала, ты возомнила себя личностью, будто бы забыв свой дождь."
        Shu "Иногда так бывает, но Город обычно быстро ставит всех на свои места."

        e "Густой туман становился непроходимым, через него не было видно даже в метре."

        LW "- Этот туман… {w=1}Я ничего не вижу…"

        Shu "- Пойдём!"

        e "Маленькая ведьма пошла… "
        e "Вскоре поняв, что это не город. "
        e "Она стояла на берегу моря."
        e "Спокойного, более не бурного. "
        e "На пляже из камней крупной гальки, обточенной волнами за многие века прибоев. "
        e "Пляж был в глубокой дымке, закутанный туманом. "
        e "Как и вода. "
        e "Стоял почти, что полный штиль. "
        e "Вдалеке было что-то… "
        e "Какие-то огромные щупальца, поднимавшиеся из воды на километры, медленно шевелившиеся."

        LW "- Что это за…"

        Shu "- Не бойся, девочка – нам они не угрожают. "
        Shu "Тебе со мной, по крайней мере."

        LW "- Откуда они?"

        Shu "- Это древнее хтоническое существо, воплощение разума океана. "
        Shu "Я сильнее, а оно не пойдёт против большей силы."

        LW "- Большей силы?"

        e "Женщина в маске только усмехнулась{w=1} – и на какое-то мгновение, раздвинув руки в стороны в позе распятия, зависла над берегом. "
        e "Её босые стопы с чёрными, острыми ногтями, парили над галькой в воздухе. "
        e "Она левитировала."

        Shu "- Ты ведь тоже так можешь?"

        LW "- Вовсе нет…"

        Shu "- Ты же ведьма!"

        LW "- Но я не…"

        e "Маленькая ведьма не нашла что сказать."
        e "Как ни странно, её спутница тоже замолчала."
        e "Некоторое время они шли. "
        e "Молча шли."
        e "Ходить по этим крупным камням было тяжело,"
        e "даже в ботинках – и тем более удивительным выглядело то, как эта в маске шла босая впереди, заставляя ведьму едва поспевать за ней."

        LW "- Куда мы идём? "

        e "Но ответа не получила."

        e "Маленькая ведьма продолжила брести дальше. "
        e "Наконец, она увидела лестницу среди красных скал, которая вела вверх, на подъём."
        e "Сверху раздался тяжёлый гул и гудок уносящегося поезда."

        LW "- Так она… {w=1}Где ты?!"

        e "Но женщина исчезла, словно её и не было. "

        e "Её лицо синее неба, глаза желты как лис, в ночи растут тут призрачные тени и нет покоя в самой чаще леса ей. "
        e "Маленькая ведьма принялась подниматься по лестнице, оставляя позади пляж, море и щупальца вдали..."

        e "******************************************"

        pass

    else:

        jump chapter4fest


>>>>>>> AngelRanga



    




        
    


    return


   

