label chapter2:
    # глава 02
    centered "{color=#ff0000}{b}{size=+8}Глава 2. Граница Между Сном и Явью{/size}{/b}{/color}"

    centered "{color=#7fbdbf}{i}А на утро выпал снег.{/i}{/color}"
    centered "{color=#7fbdbf}{i}В моем саду уж не цветет сирен{/i}{/color}"
    centered "{color=#7fbdbf}{i}В иллюзиях и в мечтаний{/i}{/color}"
    centered "{color=#7fbdbf}{i}Девочка бродит одна по миру снегов и льда. {/i}{/color}"

    e "Ночью пришла снежная буря, принёсшая с собой миллионы острых как бритва снежинок. "
    e "Мир преобразился в белую пустошь. "
    e "На море опустился густой, словно кисель, серый туман, скрывший всё за непроницаемой завесой."
    e "Маленькая ведьма проснулась. "
    e "Перебирая в своей памяти остатки сегодняшних снов, увядающих как лепестки сакуры, "
    e "она позавтракала из своих заготовленных на зиму запасов, и решила пойти на солёное озеро, чтобы заготовить средства снов. "
    e "Взяв всё необходимое с собой: кинжал и поясные подсумки для трофеев."
    e "Попыталась, открыт входную дверь."
    e "Но ни чего не вышло."

    LW "Ни чего себе! Как же я открою дверь? Вед столько снега навалило!"

    e "Дверь оказалась до того заваленной снегом. "
    e "Что пришлось ей навалиться на нее."
    e "Что бы выйти на улицу, стоило ей большого труда. "
    e "Когда дверь нехотя открылась, протяжно скрипя, словно старческие артритные  суставы. "
    e "Маленькая ведьма буквально вывалилась на улицу в сугроб. "
    e "Раскинув руки, разлеглась в пушистом и таком колючем снегу. "
    e "Поднимаясь из сугроба и отряхиваясь от снега, она огляделась по сторонам:"

    e "................"

    e "Снег был везде: "
    e "покрывал дом ведьмы, словно большая пушистая шапка с ушами, "
    e "надетая на крышу ее хижины, "
    e "расползался большими сугробами и толстым слоем белой ваты на земле, "
    e "покрывал пики острых как бритва скал. "
    e "Это предполагалось быть непродолжительной утренней прогулкой. "
    e "Но глядя на непроходимые сугробы, уверенность в этом у маленькой ведьмы улетучилась, как дым."











    menu:
        "Отступить.":
            jump fast_end
            
        "Сражаться.":
            jump chapter3
            
    return