label chapter4fest:

    LW "- Там вдалеке определённо кто-то есть, "

    e "- сделала вывод Маленькая Ведьма, после чего ускорила шаг."

    e "Звуки, что манили её, были похожи на какую-то музыку… "
    e "Да, это была именно музыка. "
    e "Неведомый и чарующий мотив звучал как ритуальная музыка неизвестного ей народа, звуковое обрамление неизвестной ей традиции. "
    e "Мерный стук барабанов, звуки флейт и чего-то струнного. "
    e "Зацикленный кольцом ритм, повторявшийся с размеренным тактом. "
    e "После блужданий среди безлюдных улиц вымершего города, услышать здесь музыку казалось чем-то выходящим за грань реальности. "
    e "Маленькая ведьма шла на звуки, которые становились всё более отчётливыми."
    e "И всё более понятно, что это была не игра воображения. "
    e "Движимая любопытством, девочка вышла, достигнув проспекта."

    e "Он не был пуст!"

    e "От увиденного Маленькая Ведьма остановилась. "
    e "Проспект был более чем люден." 
    e "От столь вопиющего, неожиданного контраста, её первоначальное оцепенение усилилось, и она ощутила ватность в ногах. "
    e "Широкая улица была полна людей, которые мерно шли, все в одном направлении. "
    e "Эти люди были наряжены во всё чёрное:{w=1} в длинные балахоны с капюшонами, или же в не менее чёрные кимоно. "
    e "Их лица были закрыты масками {w=1}– иной раз белыми, иной раз цветастыми, на иных они напоминали рогатого демона, "
    e "или же просто лишённое всяких черт лицо."

    e "Неожиданно прогремел гром, раскатившись гулким эхом. "
    e "И редкие, крупные капли дождя стали падать, за мгновение проживая свою короткую жизнь длительностью в падение."

    LW "- Здравствуйте!"
    LW "- Вы откуда?"
    LW "- Вы куда путь держите?"

    e "Маленькая ведьма подбегала к шествовавшим, спрашивая. "
    e "Но ни от кого так и не добилась ответа. "
    e "Люди в чёрном шли молча, "
    e "образуя чинную и размеренную процессию под звуки, высекаемые музыкантами где-то впереди. "

    LW "- Куда я попала?.."

    Ananim "- Это Чёрный Фестиваль, дочка, "

    e "- ответила только одна женщина, одетая в чёрное кимоно с красным поясом оби. "
    e "Её лицо, как и лица всех остальных, скрывала белая фарфоровая маска."

    LW "- Чёрный Фестиваль?..{w=1} Я не слышала про такой…{w=1} И в честь чего он…"

    Ananim "- Чёрный Фестиваль проводится раз в течение годового цикла. "
    Ananim "Это фестиваль смерти."
    Ananim "Конца жизни, за которым всегда следует новое рождение. "

    LW "- Смерти?.."

    e "Маленькой ведьме стало не по себе. "
    e "От молчаливо шествовавших фигур, безликих фигур, закутанных во всё чёрное."
    e "От мерных звуков музыки, казавшихся теперь печальными и заунывными. "
    e "От всей этой процессии, среди тумана, посреди забытого всеми пустого города. "
    e "От самого этого ощущения некой предопределённости, безысходности, решённости,"
    e " во имя которого, безмолвно прославляя увядание и смерть, шли эти толпы. "
    e "Её сердце сжималось… "
    e "Маленькая Ведьма семенила быстрыми шагами, словно пытаясь приткнуться к кому-то. "
    e "Бежала вперёд, словно норовя обогнать фестиваль. "
    e "Но на деле – так же шла со всеми, "
    e "став невольным его участником. "
    e "Было темно, но многие участники несли с собой белые бумажные фонарики, все с одним каким-то иероглифом."

    LW "- А что этот символ значит? "

    e "Маленькая ведьма пыталась спросить у одного, другого, третьего безответного участника процессии. "
    e "Но они были глухи и немы."

    Ananim "- Это иероглиф смерти… "

    e "Это произнёс голос. "
    e "Вроде человеческий, но словно… "
    e "не такой. "
    e "Было в нём что-то абсолютно неправильное. "
    e "Нечто… {w=1}зловещее. "
    e "Маленькая ведьма повернулась, встретившись с фигурой в чёрном балахоне, "
    e "нет{w=1} – скорее платье {w=1}– но с таким же чёрным и надвинутым капюшоном, в белой с некоторыми красными деталями маске."
    e "Японской маске лисы, похожей на смеющийся смайлик. "
    e "Маски, у которой не было отверстий для глаз – они были лишь нарисованы двумя изогнутыми линиями. "

    LW "- Спа… {w=1}сибо…"

    e "Женщина отвернулась, продолжая свой путь."
    e "Было в ней что-то… "
    e "Несомненно грациозное. "
    e "Но это какая-то неправильная грация, пугающая и не из этого мира. "
    e "Её походка, не в такт и с малозаметными искажениями, словно она слабо прихрамывала, "
    e "а всё остальное тело колебалось в ответ, вела прямиком в зловещую долину. "
    e "Впечатление дополняли пальцы её рук, с длинными чёрными ногтями и перстнями,"
    e " выписывавшие какие-то незаметные знаки, значения которых девочка не понимала."

    e "Процессия продолжалась. "
    e "Маленькая ведьма шла вперёд, протискиваясь между рядов людей, нёсших белые фонари. "
    e "Ряды становились плотнее, а музыка – громче и отчётливее. "
    e "И вот {w=1}– она практически добралась до края, узрев главу всей процессии. "
    e "Странный высокий мужчина, с густой бородой и длинными, нечесаными волосами, в оборванной и грубой одежде, "
    e "с перемотанными грязными бинтами ладонями, нёс подобие христианского креста. "
    e "Подобие, отличавшееся тем, что кроме четырёх концов, из пересечения выходили ещё четыре острых луча, образовывавших Х. "

    e "Он провозглашал зычным голосом, сильным и глубоким. "
    e "Толпа повторяла за ним в единый многоголосый унисон:"

    nvl clear
    nvl show #dissolve

    "{color=#23a7e0}{i}Изгони навек воспоминания о мире иллюзий в ранней мгле.{/i}{/color}"
    "{color=#23a7e0}{i}Наш бренный мир стоит в ненадежном море из песка.{/i}{/color}"
    "{color=#23a7e0}{i}Выдуманный сон об истории древнего мира тайн сокровенных,{/i}{/color}"
    "{color=#23a7e0}{i}Ясный солнца свет воплотит на тонущих в бездне улицах,{/i}{/color}"
    "{color=#23a7e0}{i}Это фантазия, или хрупкий замок из песка?{/i}{/color}"
    "{color=#23a7e0}{i}До рассвета, этот сон – словно сон бабочки.{/i}{/color}"

    nvl clear
    window show

    e "Песнопение повторялось по второму, третьему кругу, становясь всё более неистовым и исступлённым. "
    e "Оно становилось чем-то похожим на мантру, даже на шаманское камлание. "
    e "Люди повторяли снова и снова, вгоняя себя в какое-то подобие транса, "
    e "и эти слова раздавались до самого конца процессии, проходя через всю толпу, как электрический ток проходит через провод."

    nvl clear
    nvl show #dissolve

    "{color=#23a7e0}{i}Изгони навек воспоминания о мире иллюзий в ранней мгле.{/i}{/color}"
    "{color=#23a7e0}{i}Наш бренный мир стоит в ненадежном море из песка.{/i}{/color}"
    "{color=#23a7e0}{i}Иже беззакония наши безмерны и вина наша тяжела,{/i}{/color}"
    "{color=#23a7e0}{i}В беззаконии и грехе рождённые,{/i}{/color}"
    "{color=#23a7e0}{i}Жаждущие Истины и Света,{/i}{/color}"
    "{color=#23a7e0}{i}Дай нам возрадоваться Искуплению...{/i}{/color}"

    nvl clear

    e "Небо прочертили молнии, редкие капли превратились в бодрый душ. "
    e "Душ {w=1}– в отвесную стену. "
    e "Народ, несмотря на проливной ливень, продолжал идти и скандировать, а музыка не затихала."

   

