label chapter2:
    # глава 02
    centered "{color=#ff0000}{b}{size=+8}Глава 2. Граница Между Сном и Явью{/size}{/b}{/color}"

    centered "{color=#7fbdbf}{i}А на утро выпал снег.{/i}{/color}"
    centered "{color=#7fbdbf}{i}В моем саду уж не цветет сирен{/i}{/color}"
    centered "{color=#7fbdbf}{i}В иллюзиях и в мечтаний{/i}{/color}"
    centered "{color=#7fbdbf}{i}Девочка бродит одна по миру снегов и льда. {/i}{/color}"

    e "Ночью пришла снежная буря, принёсшая с собой миллионы острых как бритва снежинок. "
    e "Мир преобразился в белую пустошь. "
    e "На море опустился густой, словно кисель, серый туман, скрывший всё за непроницаемой завесой."
    e "Маленькая ведьма проснулась. "
    e "Перебирая в своей памяти остатки сегодняшних снов, увядающих как лепестки сакуры, "
    e "она позавтракала из своих заготовленных на зиму запасов, и решила пойти на солёное озеро, чтобы заготовить средства снов. "
    e "Взяв всё необходимое с собой: кинжал и поясные подсумки для трофеев."
    e "Попыталась, открыт входную дверь."
    e "Но ни чего не вышло."

    LW "Ни чего себе! Как же я открою дверь? Вед столько снега навалило!"

    e "Дверь оказалась до того заваленной снегом. "
    e "Что пришлось ей навалиться на нее."
    e "Что бы выйти на улицу, стоило ей большого труда. "
    e "Когда дверь нехотя открылась, протяжно скрипя, словно старческие артритные  суставы. "
    e "Маленькая ведьма буквально вывалилась на улицу в сугроб. "
    e "Раскинув руки, разлеглась в пушистом и таком колючем снегу. "
    e "Поднимаясь из сугроба и отряхиваясь от снега, она огляделась по сторонам:"

    e "................"

    e "Снег был везде: "
    e "покрывал дом ведьмы, словно большая пушистая шапка с ушами, "
    e "надетая на крышу ее хижины, "
    e "расползался большими сугробами и толстым слоем белой ваты на земле, "
    e "покрывал пики острых как бритва скал. "
    e "Это предполагалось быть непродолжительной утренней прогулкой. "
    e "Но глядя на непроходимые сугробы, уверенность в этом у маленькой ведьмы улетучилась, как дым."

    e " Ведомая демоном-искусителем, ведьма почувствовала возбуждения от неожиданно наступившей белой сказки и предчувствия... "
    e "Она никогда не испытывала такого предчувствия и предвкушения скорой встречи с кем-то или чем-то. "

    LW "{i}« - Уже очень скоро. »{/i}"

    e "– Повторяя в своей голове эту фразу. "
    
    LW "{i}«- Но я перечислю все знаки числа „пи“ до того, как доберусь до озера через эти все сугробы». {/i} "
    
    e "– Раздосадовано подумала маленькая ведьма."
    e "Ей не терпелось увидеть новую историю, которую она не знала. "
    e "Пробираясь через белую пустыню девственно-чистого снежного наста. "

    LW "{i}« - Острый, как лезвие бритвы, ум Наставницы, облеченной в мягкие формы, часто приобретал насмешливый, почти иронический оттенок. {/i}"
    LW "{i}В эти периоды Наставница говорила: что мир вокруг – всего лишь голограмма, {/i}"
    LW "{i}а то, что принимается за реальность, - сложные игры интерференционных рисунков и сознания наблюдателя. {/i}"
    LW "{i}Крошечные фотоны свет, как и частицы материи. {/i}"
    LW "{i}Обладают загадочным с точки простого обывателя свойством. {/i} "
    LW "{i}Они имеют двойственную природу – существуют как материальные объекты и как волновые образовании. {/i}"
    LW "{i}И представляют собой не совокупность микроскопических материальных тел, а кратковременное взаимное наложение (сгущение) энергетических полей». {/i}"

    e "Сны внушали Маленькой ведьмы, что любая форма в пространстве образуется при пересечении той или иной фигуры с большим количеством измерений. "
    e "Квадрат это результат сечения куба, а круг сечения сферы. "
    e "Возьмём самую обычную сферу, любую точку на ней можно задать двумя параметрами — параллелью и меридианой, "
    e "поэтому логично полагать что сфера — это двумерное пространство, просто оно не плоское, а вот такое вот сферическое и замкнутое само на себя. "
    e "Другие, сферы с количеством протяженных измерений больше трех, представить сложнее, но они встречаются столь, же часто. "
    e "Это трехмерные сферы, подобные поверхностям надувных мячей, "
    e "в которые играют на песчаных океанских пляжах во вселенной с четырьмя протяженными пространственными измерениями. "
    e "О чем обычные люди до сих пор лишь изредка видели в своих снах. "
    
    e "Она размышляла над загадками бытия, и завершила свои размышления следующим:"

    LW "{i}« - Последний шаг разума заключается в том, чтобы признать существование множества таких вещей, {/i}"
    LW "{i} которые выходят за пределы познания, и если разум не приходит к этому познанию, то он весьма слабый». {/i}"

    e "............."
    e ".........."
    e "....."

    e "И вот девочка очутилась на берегу небольшого Солёного озера, "
    e "взглянула на покрытую серой снежной кашей мутную водную поверхность, над которой висел клочковатый рыжий туман. "

    e "{i}Соленое озеро, как, впрочем, и ущелье, где оно находится, напоминают двуликого Януса, {/i}"
    e "{i}так непосредственны они и переменчивы!  {/i}"
    e "{i}Зимой вода в озере всегда пресная и теплая, как парное молоко. {/i}"
    e "{i}Если набрать ее, то в открытой посуде можно хранить годами, и не утратит она родниковой свежести.  {/i}"
    e "{i}В первых фазах третей луна трех четвертых года, а точней на излете зимы, начинается резкое, {/i}"
    e "{i}скачкообразное засоление, да такое стремительное, что уже к концу фазы третей луны утонуть в озере при всем желании становится невозможным. {/i}"
    e "{i}Ущелье же не всякого пришлого примет.  {/i}"
    e "{i}Находиться среди трухлявых вывалов, стоящих стеной деревьев, одуряющее пахнущего разнотравья могла только привыкшая к причудам местной природы и климата маленькая ведьма. {/i}"

    e "Девочка прошла вдоль обрывистого бережка, обогнув его, и приблизилась к крутому массиву скал. "
    e "Там была расщелина, ведущая в систему гигантских пещер - в вечной темноте, куда ни проникал, ни единый лучик звёзд. "
    e "Там обитали пауки снов, плетущие паутины грёз. "
    e "Она охотилась на них, добывая из их желёз средства снов, которые помогали ей путешествовать по чужим снам."

    e "Она осторожно подошла к расщелине, зияющей опасным чёрным провалом посреди белого мира. "
    e "Снег покрывал только ближайшие несколько шагов, а дальше начиналась голая неровная поверхность из скальных пород. "
    e "Пещера ввела девочку в чёрный подземный мир. "
    e "Она зашла под своды, с которых свисали сталактиты; хоть мир здесь и был чёрным, но не тёмным, и она могла видеть путь."
    e "И время от времени словно звездочки поблескивали минералы."
    e "Маленькая ведьма углублялась всё дальше и дальше в пещеру."

    e " Мир преображался вокруг неё с каждым её шагом. "
    e "Словно волшебство. "
    e "То тут, то там на стенках влажных сводов пещеры на глаза маленькой ведьме попадались пятна голубого мха, "
    e "холодно светившегося в темноте, наростами террас росли колонии белых мясистых грибов довольно больших размеров с чашечками в середине, "
    e "куда собиралась влага, и небольшими озерцами блистая в мертвящем сиянии. "
    e "Грибы мерцали холодным свечением, которое практически ничего не освещало, и рядом с ними вились крупные светляки, и бабочки-мотыльки с голубоватыми крыльями. "
    e "Маленькая ведьма на ладони перед собой зажгла небольшую сферу, вспыхнувшую ярким красным пламенем, освещая пространство вокруг неё; длинная тень простёрлась за спиной маленькой ведьмы, скрываясь во тьме. "
    e "В этом царстве тьмы и мерцания."

    e " Сначала мхов и грибов видно было немного: небольшие пушистые пятна величиной со спичечный коробок не спешили показываться на глаза. "
    e "Но чем больше освещала сфера ведьмы, тем их становилось больше, она находила грибы крупнее, а мох застилал пушистым ковром всё доступное взгляду пространство. "
    e "Они росли на камнях, свисали гроздями со сводов. "
    e "Вся пещера была наполнена мягким голубоватым свечением."
    e "И вот она уже шла по толстому ковру голубого мха."
    e "После каждого её шага в воздух взмывали облачка пыльцы, чуть заметно искрившиеся в воздухе. "
    e "Галерея, по которой она шла, уходила вод наклоном, потом делала поворот; от неё отделялись другие галереи, оканчивающиеся залами, из которых вели другие проходы и залы. "
    e "Это был очень сложный мир - бесконечное множество пещер и коридоров образовывали его. "
    e "Своды разошлись в стороны, образуя большую просторную пещеру, в которой сталагмиты и сталактиты оплетал мох, образуя с ними подобие деревьев, "
    e "отчего эта пещера выглядела как причудливый иллюзорный лес находящихся в сладком сне, нежели на яву. "
    e "Дальше её путь простирался, поэтому подземному лесу."

    e "Среди сияющего мха и грибов она увидела то, что искала: паутину грез. "
    e "Она сияла в темноте гораздо ярче, чем всё, что ее окружало, переливалась причудливыми пёстрыми цветными пятнами, образуя сюрреалистический вид узоров-фракталов. "
    e "Маленькая ведьма, будто мотылек, привлечённый пламенем свечи, устремилась к ней, осторожно держа кинжал в одной руке."
    e "Потушив сферу, она смогла сориентироваться в сгустившемся мраке по сиянию паутины грез. "
    e "Как поняла маленькая ведьма, добыча к паукам снов попадает, привлеченная именно этим необычным свечением в мире постоянной полутьмы. "

    e "Здесь была арка над подземной речушкой и несколько уровней пещеры. "
    e "Паутина под аркой цеплялась своими нитями за выступы и ближайшие сосульки «деревьев»."
    e "Маленькая ведьма осторожно подошла к арке; она хорошо видела светящуюся паутину под ней, её нити были толсты, "
    e "очень длинными и яркими, новыми. "
    e "Паук снов сплёл их совсем недавно, паутина ещё не потускнела и не была порвана попавшими в неё жертвами."

    e " В темноте возле одной из нитей паутины, уходившей под нависающий обрыв на другом берегу, ведьма увидела паука снов. "
    e "В его многочисленных бусинках глаз отражалась бликами светящееся паутина. "
    e "Она видела его тупую голову с прикрывавшими ротовую полость лохматыми короткими педипальпами, которые нетерпеливо подергивались. "
    e "Это был самец. "
    e "Самцы - крупные особи размером с кошку, охотники, поджидающие своих жертв в засаде недалеко от паутины грёз. "
    e "Стерегущую очередную жертву, которой не повезло в ней запутаться."
    e "Самка обычно находилась где-то поблизости от самца."
    e "В отличие от большинства земных пауков, где самки обычно сжирали самцов после оплодотворения, эти пауки образовывали союз до конца своей жизни, а следовательно, и охотились вдвоём. "
    e "И пока самец ждал в засаде возле паутины, самка ползала по окрестностям, впрочем, стараясь не отходить слишком далеко."
    e "Ведьма не хотела его убивать самку, но ей нужна была именно паучиха грёз. "
    e "Она обратила внимание, что в сетях что-то запуталась и отчаянно трепыхается. "
    e "Паук снов, как обычно, вылез из своего укрытия и надменно полез к добыче, бесшумно заскользив по паутине."

    e "Маленькая ведьма никогда раньше не видела такого существа. "
    e "У него были крылья как у птицы воробья или что-то подобного."
    e "Оно было достаточно крупное; маленькой ведьме показалась, что это существо размером с ребёнка. "
    e "Тем временем паук уже дополз до трепыхающейся твари."
    e "Для пауков снов размер добычи не имеет значение, они могут спокойно поймать существо любого размера, даже значительно крупнее их, благодаря средству снов. "
    e "Маленькая ведьма не испытывала ни жалости, ни желания помочь несчастной добыче - всё же это была жизнь, где сильнейший выживает за счёт более слабого. "
    e "Она знала, что сейчас с мгновение на мгновение трепыхание в сети грёз должно привлечь паучиху, и озиралась по сторонам, выискивая её взглядом."

    e "Маленькая ведьма заметила её в тенях. "
    e "Чёрная, словно покрытая торчащими волосками стальной проволоки, паучиха перебирала своими лапами, приближаясь. "
    e "Она почему-то не обращала внимание на то, что делалась в сетях грёз, найдя, по-видимому, "
    e "более желанную и крупную добычу в лице маленькой ведьмы. "
    e "И теперь вот она подбиралась к ней, намереваясь заполучить свой трофей. "


    menu:
        "Отступить.":
            jump fast_end
            
        "Сражаться.":
            jump chapter3
            
    return