label chapter3:

    $ Cha_02 = renpy.random.choice([1, 2])

    if Cha_02 == 1:
        
        e "Ведьма уже ясно видела её острые жала с железами, наполненными ядом снов. "
        e "Она выставила свой кинжал вперёд, в надежде защитится от самки, если та надумает напасть на маленькую ведьму. "
        e "Паучиха, издавая протяжный свистящий звук, понеслась на нее через арку; "
        e "когда расстояние между ней и маленькой ведьмой было не более чем несколько метров, "
        e "паучиха неожиданно прыгнула на неё. "
        e "Маленькая ведьма, попятившись назад, попыталась отмахнуться от неё вынутым кинжалом. "
        e "Но ей это не удалось: паучиха, резко изменив траекторию, шлёпнулась перед её ногами. "
        e "Маленькая ведьма хотела пнуть её ногой, но не успела. "
        e "Острые жала прошли через её сапог, впрыснув в кровь девочки яд снов."
        e "Уже теряя сознание, она всё же всадила в самку свой кинжал. "
        e "Надо было действовать быстро, пока яд не распространился по крови, и она не погрузилась в вечный сон... "
        e "Ведьма нащупала подсумку на поясе."
        e "В них хранилась противоядие, если не выветривающее яд полностью, то по крайней мере значительно снижающее эффективность его действия."

        e " Средство снов, этот яд пауков, с помощью которого они охотятся на свои жертвы, {w=1}попавшие в их причудливые паутины, впрыскивается в жертву, вызывая эйфорические галлюцинации, лишающие её какого-либо сопротивления."
        e " И когда пауки начинают пожирать свою добычу, та пребывает в снах, наслаждаясь ими. "
        e "Именно поэтому укус пауков снов был так опасен."
        e "Но ведьма приняла противоядие. "
        e "Вспомнив о самце, она резко обернулась к сверкающей паутине: "
        e "самец был всё ещё там и оплетал паутиной добычу, превращая её в большой светящийся кокон."
        e "Девочка на ватных ногах поспешила покинуть этот мир; "
        e "её охота сегодня не удалась, и оставаться здесь более чревато ее гибелью."

        pass

    elif Cha_02 == 2:
        
        e "Холодный липкий страх сковал Маленькую Ведьму, "
        e "что в оцепенении наблюдала за неумолимо надвигавшейся паучихой, острые жала которой готовы впрыснуть в неё яд снов… "
        e "Однако в последний момент она сбросила с себя оцепенение усилием воли и выставила кинжал вперёд… "
        e "Её сердце безудержно колотилось, тело лихорадило от притока адреналина…"
        e "… Ведьме хотелось бежать, бежать из этого проклятого тёмного места...  "
        e "Но этот смертоносный импульс зарождающейся паники она смогла в себе подавит... "
        e "Она слишком хорошо понимала, что страх - плохой союзник, ему нельзя поддаваться,"
        e "а подавшись можно совершить непростительную глупость."
        e "А глупость – это смерть!"

        LW "- Соберись!... {w=1}Возьми себя в руки, Ведьма! "

        e "! – крикнула она себе, пытаясь перенаправить страх в ярость… "

        e "Маленькая Ведьма отчётливо видела острые жала, впрыскивающие яд снов из желёз чудовища. "
        e "Паучиха, издавая протяжный свистящий звук, совершила ловкий прыжок, "
        e "неожиданно грациозный для подобного существа… "
        e "Маленькая Ведьма сумела уклониться, и лишь волна воздуха обдала её лицо…"

        e "Промахнувшись, паучиха быстро развернулась, готовясь к новому прыжку."
        e "Пятясь назад, Маленькая Ведьма приготовилась поразить летящую в неё тварь. "
        e "Но ей это не удалось…"

        e "Паучиха оказалась хитрей… "
        e "Вместо того, чтобы целиться в голову или шею, паучиха, прочертив дугу в воздухе, шлёпнулась ей под ноги. "
        e "Маленькая Ведьма попыталась её пнуть – но паучиха оказалась быстрее."
        e "Она запрыгнула ей на ногу, вцепившись всеми своими конечностями в голенище сапога, и вонзила свои ядовитые жала в икроножную мышцу… "

        e "Следом за этим {w=1}– Маленькая Ведьма вонзила свой кинжал в паучью голову, убив самку…"

        e "Паучиха успела впрыснуть ей в кровь только часть яда{w=1} – но этого было достаточно,"
        e " чтобы ощутить мертвящее прикосновение холода, волнами расходящегося по телу. "
        e "Ноги стали абсолютно ватными, а тело начало неметь…"

        e "Надо было действовать быстро, пока яд не погрузил её тело в вечный сон... "
        e "Ведьма нащупала нужный подсумок, в котором находился флакон с противоядием, значительно снижающим эффективность яда снов... "
        e "Опрокинув в себя безвкусное содержимое склянки, она побрела назад…"
        e "Ватные ноги плохо слушались, а голова кружилась как пьяный матрос…"

        e "Средство снов – это всего лишь алхимически обработанный яд пауков,"
        e " который в своём первозданном виде был чудовищно эффективным врождённым оружием… "
        e "Подвергнутая его воздействию жертва теряет какую-либо связь с реальным миром."
        e "И когда пауки начинают пожирать свою добычу, та пребывает в снах, наслаждаясь ими…"
        e "Именно поэтому укус пауков снов был так опасен. "
        e "Но Ведьма успела принять противоядие. "
        e "Вспомнив о самце, она резко обернулась к сверкающей паутине: {w=1}самец был всё ещё там и оплетал паутиной добычу, "
        e "превращая её в большой светящийся кокон. "
        e "Нетвёрдой походкой, держась за стену пещеры, Маленькая Ведьма поспешила покинуть этот опасный подземный мир. "
        e "Её охота сегодня не удалась, и оставаться было чревато гибелью…"

        pass




    centered "{color=#ff0000}{b}{size=+10}Глава 03. Иллюзорная Бесконечная Ночь и Фантастическая Женщина{/size}{/b}{/color}"

    centered "{color=#7fbdbf}{i}В одиночестве она всегда,{/i}{/color}"
    centered "{color=#7fbdbf}{i}В тумане снов своих плывет.{/i}{/color}"
    centered "{color=#7fbdbf}{i}И девочки мечта уходит вдаль,{/i}{/color}"
    centered "{color=#7fbdbf}{i}В веках живя в симметрии грез.{/i}{/color}"

    $ Cha_03 = renpy.random.choice([1, 2])

    if Cha_03 == 1:
        
        
        e "Маленькая Ведьма не помнила, "
        e "каким образом выбралась из пещеры на поверхность ущелья - словно реактивный лайнер, "
        e "автопилотируемый бортовым ИскИном, она была пассажиром в собственном частично онемелом теле."
        e "Её ноги будто двигались сами по себе, "
        e ", а в глазах сияли всполохи радужных цветов."
        e "Свинцовая голова кружилась, как будто по ней треснули дубиной."
        e "А ещё тошнило, и хотелось бл…"

        LW "- БЛЛЛлуууэээ…."

        e "Ноги Маленькой Ведьмы подкосились, заставив её упасть на колени, весьма чувствительно ударившись об оголённый гранит. "
        e "Отравленный девичий организм произвёл сброс содержимого желудка, в котором узнавались недопереваренные остатки завтрака, подкрашенные недавно выпитым зельем… "

        e "Переводя дух, Маленькая Ведьма думала, что бывало в её ведьминой жизни и хуже… "
        e "Отойдя на всех четырёх в сторону, дабы не упереться в собственную блевоту при попытке встать, она, "
        e "наконец, упёрлась ладонями в холодный камень, и не без труда приняла вертикальное положение. "
        e "По крайней мере, после опустошения желудка ей стало немного легче. "
        e "Морозный воздух щипал ее за щёки, и голова стала слегка ясней. "

        e "Уже смеркалось. "
        e "Холодало. "
        e "Идя по берегу солёного озера, Маленькая Ведьма смотрела на красную, густую как вишнёвый кисель воду. "
        e "И вдруг, уловив периферийным зрением нечто странное – она повернулась… "
        e "И как повернулась – так и осела на грунт снова…"

        e "На снежном насте был продавлен огромный след шестипалой босой ступни. "
        e "И даже не просто продавлен, а будто прожжён. "
        e "Внутри следа отсутствовал не только снег, но даже сухая трава. "
        e "Лишь голая земля, почему-то отдающая рыжей ржавчиной… "
        e "Но ещё более поразительным зрелищем был роскошный павлин, дразнивший её распущенным, словно веер, многоцветным хвостом…"

        e "Но здесь не водились павлины… "
        e "Им неоткуда было взяться на этой планете… "
        e "Разве что…"

        e ""
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    e "Не помня, как она выбралась из той пещеры на поверхность, маленькая ведьма стояла на берегу солёного озера. "
    e "Уже смеркалось. "
    e "Холодало. "
    e "Её голова кружилась в радужных пятнах, её тошнило. "
    e "Ведьма смотрела на красную, густую как вишнёвый кисель воду."
    e "А совсем рядом, читай, под носом у маленькой ведьмы, "
    e "на снежном насте чётко просматривалось натуральное чудо - проплешина формы шестипалой, "
    e "босой, нечеловеческих размеров ступни, в которой полностью отсутствовал снег, и даже сухая трава. "
    e "Взору ведьмы открывалась лишь голая и почему-то отдающая рыжей ржавчиной земля. "
    e "Рядом с этим следом сидел роскошный павлин с распущенным, словно веер, дразнящим своим многоцветьем хвостом."

    e "Маленькая ведьма, где стояла, там и села, - не в силах отвести взгляд. "
    e "Нет, она не испугалась. "
    e "На нее вдруг навалилась чувство какой-то трудно передаваемой, пробирающей до костей безнадежности. "
    e "Но это чувство вскоре переросло в полнейшее равнодушие."
    e "Она без всяких эмоций побрела по тропинке. "
    e "Морозный воздух щепал ее за щеки, и голова стала немного ясней. "

    e "Она без особых приключений добралась до своей хижины." 
    e "Над маяком сияло искусственное солнце."
    e "Зайдя внутрь и оббив остатки снега со своих сапог об порог, она подошла к печке. "
    e "Открыв заслонку, маленькая ведьма долго смотрела на мерцание огня. "
    e "И что-то бесшумное появилось в его мечущихся всполохах. "
    e "В пламени печи металась, трепетала точеная девичья фигурка. "

    LW "« - Может я и вправду начала сходить с ума?»"
    LW "«Огненная фея?» "
    LW "«Саламандра?» "

    LW "- Все страньше и страньше!"

    e "! - вскликнула маленькая ведьма. От изумления она совсем забыла, как нужно говорить. "

    LW "«Неужели надо расценивать случившееся как знак?» "

    e "Дрожа от этой мысли, маленькая ведьма стала лихорадочно думать, что ей делать дальше. "

    LW "«Может, затушить огонь или просто уйти восвояси?» "

    e "Фигурка становилась все четче и материальной, и вот она отделилась от огня, выпорхнув в комнату на пол. "
    e "Маленькая ведьма испугалась, что пол под ней может загореться. "
    e "Но ничего не произошло, пламя просто исчезло, а фигурка преобразилась, увеличившись в размерах."

    e " Перед ведьмой стояла женщина в объемном черном платье со множеством ленточек и завитистым узором фрактала, вышитом на нем."
    e "Ее волосы были убраны под причудливым головным убором, напоминающем шапку арлекина с двумя свисающими оберегами на красных нитях."
    e "Концы этой шапки были похожи на ушки кошки или лисы."
    e "А позади нее развевались девять пушистых лисьих хвостов."
    e "Женщина держала руки в свободных рукавах сложенными на груди."

    LW " - Кто ты? "

    e "– спросила маленькая ведьма."

    GO " - Твой друг,"

    e "– ответила она, легко прикоснувшись ко лбу маленькой ведьмы."

    e "Сознание маленькой ведьмы погрузилось в бездну того чуждого нормальной психике, "
    e "чему трудно, а может, невозможно подобрать разумное определение, "
    e "плутая не то в лабиринтах смутных видений, не то в напоминающих реальность кошмарных галлюцинациях. "
    e "Женщина подошла к девочке и аккуратно перенесла ее на кровать, после чего исчезла, также внезапно, как и появилась."

    e "..............."
    e "..........."
    e "......"

    e " Маленькую ведьму бросало то в жар, то в холод. "
    e "Лицо, грудь, руки покрылись волдырями, одолевала одышка."
    e "И впала маленькая ведьма в кружащее, как карусель,"
    e " противное и липкое забытье, через которое время от времени прорывались какие-то звуки, запахи, образы. "
    e "Потом, очевидно, ненадолго, наступила звенящая тишина, прерванная оглушительным требовательным стуком. "
    e "И в ее вдруг ставшее неестественно объемным поле зрения вломились два пугающе плоских, будто вырезанных из картона силуэта. "
    e "С ужасом маленькая ведьма увидела, "
    e "что эти силуэты - иссиня-черные квадратные доски с нарисованными на них мелом мужскими фигурами: губы обведены алой помадой, "
    e "глаза – зеленые виноградины с пульсирующими кошачьими зрачками. "
    e "Вместе с этими странными пришлыми возник, именно возник, слепящее яркий, пышущий нестерпимым жаром фонарь. "
    e "Этот фонарь словно высасывал из маленькой ведьмы все самое тайное и сокровенное."

    e " Обратились к ней люди-доски с абсурдным требованием:"

    FN "- Кинжал давай, потом вернем, что останется от него! "

    e "– и кинжал, повиснув между ней и пришлыми, заискрившись, подобно бенгальскому огню, "
    e "рассыпался красивыми и крупными желто-зелеными искрами, выгорел до рукоятки. "

    FN "– Без кинжала ты не опасна, поэтому теперь будешь одной из нас. "
    FN "Ты станешь добывать для нас яд снов, "

    e "– скрипучими, словно исходящими из граммофонной трубы голосами объявили люди-доски."

    LW " - Зачем вам яд снов? "

    e "– поинтересовалась маленькая ведьма."

    FN " - У нас нет души. "
    FN "Это очень плохо. "
    FN "Для вас яд снов – корень жизни, для нас он - корень души. "
    FN "Когда он есть – мы добры и великодушны, когда нет – жестоки и холодны. "
    FN "Ты - с высоким уровнем готовности к сотрудничеству."
    FN "Яд снов, собранный тобой, будут иметь силу… "
    FN "Ты обязана помочь."

    LW " «Мудрено, путано все это как-то» "

    e "- думала маленькая ведьма."

    e " И тут ей на секунду показалось, что она вернулась в привычную обстановку. "
    e "Пустая комната, тускло освещенная маленькой лампадкой. "

    e " Но вот опять дурацкий жаркий свет и скрипучие голоса:"

    FN " - Мы говорим понятней вас. "
    FN "Мы творцы всеобщего восхождения на уровень 777. "
    FN "Семерка – сакральное число и наш опознавательный код. "
    FN "Павлин, которого мы показали тебе – символ Христа."
    FN "Босая ступня – наш знак тебе, что мы появимся. "
    FN "Мы сказали все. "
    FN "Жди нас снова."

    e " С головы маленькой ведьмы будто сняли давящую чугунную шапку. "
    e "Поднявшись с кровати и открыв дверь, она вышла, пошатываясь, в ночь...{w=1} в тишину. "
    e "Вдохнув отвратительный воздух, сильно пахнувшей серой, задумалась."

    LW "«Что это преследует меня – болезнь, навязчивый бред?» "

    e "– в который раз спрашивала себя маленькая ведьма."

    e "Ночной галлюциногенный ад продолжился и казался бесконечной ночи. "
    e "Маленькая ведьма хотела, но не могла покинуть это место. "
    e "Она не имела сил разрушить невидимую стену, "
    e "предусмотрительно и надежно возведенную между ней и миром чуждой силой. "
    e "Тем не менее, как показалась маленькой ведьме, эта сила допустила ее к бездонной кладовой отборных пауков снов. "
    e "Сначала ведьму обуяла алчность. "
    e "Но когда на берег опустился холодный туман, отрезвив ее, она решила во что бы то ни стало вырваться из плена кошмара."

    e "{i}Критериев живого в чистом виде не существует и не может существовать. {/i}"
    e "{i}Может быть, в природе и существовало нечто, {/i}"
    e "{i}что обеспечивало ее действительную связь между объективным и субъективным, между материей и духом. {/i}"

    e " То ли в бреду, то ли наяву она снова сидела у озерной воды, "
    e "густой и красной как кисель или кровь, пока не появились люди-доски,"
    e " бесцеремонно и грубо увлекшие ее на дно. "
    e "И снова пред ее взором мелькнул павлин, распушивший свой роскошный хвост."

    e " Маленькая ведьма осознала себя бредшей по извилистым узким тонувшим в бездне уличкам каменного града, утопающего в густом липком тумане. "
    e "Она оглядывается по сторонам, не понимая, где она находится.	"


    jump chapter4
    
    return