label chapter4:

    centered "{color=#ff0000}{b}{size=+10}Глава 04. Иллюзорный Город Куклы{/size}{/b}{/color}"


    centered "{color=#7fbdbf}{i}Круг единый создав, будут сотни в нём цветов.{/i}{/color}"
    centered "{color=#7fbdbf}{i}Кружится, кружится платья воздушный подол.{/i}{/color}"
    centered "{color=#7fbdbf}{i}В такт движениям танца он плавно парит над цветами.{/i}{/color}"
    centered "{color=#7fbdbf}{i}Цветочный фестиваль иллюзорного мира.{/i}{/color}"

    $ Cha_04 = renpy.random.choice([1, 2])

    if Cha_04 == 1:

        e "Воздух был холодным и сирым , а ещё пронизан каким-то неописуемым ощущением пустоты. "
        e "Или одиночества. "
        e "Густой и липкий, похожий на дым туман сокращал видимость до едва ли десятка метров, "
        e "и на границе этого тумана вычерчивались резные линии эклектической архитектуры неизвестного, "
        e "но будто смутно знакомого города."
        e "Шагами, мерившими тысячелетия, Маленькая Ведьма двигалась по выщербленной брусчатке, "
        e "пугливо озираясь по сторонам – будто ожидая неизвестных чудовищ, прячущихся в пустых глазницах окон…"

        e "С каждым шагом по выщербленной брусчатке Маленькая Ведьма чувствовала это странное щемящее ощущение. "
        e "Не то дежавю, не то ложной ностальгии по куску пространственно-временного континуума, "
        e "будто слепленному словно коллаж из старинных открыток, фотокарточек и газетных передовиц. "
        e "Это место напоминало о старой Европе – с узкими улочками, плотно примкнутыми друг к другу нагромождениями домов,"
        e " с тканевыми маркизами над некоторыми окнами и маленькими ажурными балкончиками под ними. "
        
        e "Но город пыл пуст, безлюден и безмолвен. "
        e "Он выглядел покинутым, "
        e "а цветы, вывешенные в витиеватой обрешётке цветники под окнами – неухоженными и засохшими, словно некому было их поливать. "
        e "С каждым гулким шагом по брусчатой мостовой, эта противоестественная пустота наводила тоску и тревогу."
        e "Наконец, набравшись смелости, Маленькая Ведьма громко прокричала:"

        LW "- Где я нахожусь… "
        LW "ЭЙ!! {w=1}ЕСТЬ {w=1}ЗДЕСЬ {w=1}КТО-НИБУДЬ?!!"

        e "Звонкий девичий крик прозвучал в пустоту."
        e "Словно камешек, сброшенный в бездонную пропасть. "
        e "Маленькой ведьме оставалось лишь стоять, озираясь, глядя на отсутствие какого-либо движения на улице или в окнах. "
        e "В одном из них она, на мгновение, увидела одиночный яркий цветок, "
        e "находившийся в несравнимо лучшем состоянии по сравнению с пожухлым содержимым балконных цветочных ящиков. "
        e "Розу, накрытую какой-то стеклянной колбой. "
        e "Она стояла на окне, алая и неувядаемая. "
        e "По правую сторону от неё сидела странная кукла мальчика в шарфике… "
        e "Похожем на её шарф... "
        e "Слева был плюшевый лис…"

        LW "- Какая странная композиция на окне стоит. "
        LW "Неувядающий цветок и эти двое. "
        LW "Космический странник, скитавшийся среди звёзд и планет. "
        LW "Его вечная, неугасимая любовь. "
        LW "И лис, воплощение бескорыстной дружбы и понимания между всеми формами разума…"

        e "Маленькая ведьма отвела свой взгляд от окна. "
        e "Эта часть города очевидно была самой старой, "
        e "даже средневековой, с изъеденными деревянными рамами окон, вмонтированных в приземистые камене здания. "
        e "Со ставнями на фасадах, некоторые из которых были оборванны с петель, словно некому было взять и починить их."

        e "Маленькая Ведьма продолжила свой путь. "
        e "Озираясь на хорошо различимые даже сквозь туман деревянные вывески маленьких магазинчиков и мастерских, "
        e "она шла и шла, бродя по ветвистым улочкам и переулкам странного города. "
        e "Каблуки неспешно постукивали по старой, истёртой веками брусчатке, а взгляд ловил печальное однообразие и горькую, сиротскую пустоту. "
        e "Казалось, что город умер – словно породистый и красивый, но слишком старый пудель,"
        e "обветшавшее тело которого не справилось с поддержанием жизни."

        e "Сколько Маленькая Ведьма ни бродила, сколько ни рыскала по узким извилистым закоулкам – она не видела никого. "
        e "Ни человека, ни кошки, ни собаки. "
        e "Она не слышала ничего кроме давящей, оглушающей тишины и всё более сгущавшегося, "
        e "непроглядного тумана, через который, как сквозь вуаль, прочерчивались очертания. "
        e "Всё, что окружало её путь – это плотные ряды домов, глухие каменные стены которых перемежались с обширными витринами опустевших магазинчиков. "
        e "Лепнины и карнизы, оцинкованные водосточные трубы."
        e "Двухпокатые черепичные крыши, цвет которых невозможно было определить."
        e "Старые, железные чёрные фонари, которые не горели. "
        e "Вдали возвышались пронзающие небеса готические шпили средневекового собора…"

        e "Но была ещё одна деталь, бросившаяся в глаза Маленькой Ведьме далеко не сразу ввиду своей невзрачности и зловещей обыденности. "
        e "На улицах, по которым давно не ступала нога дворника, был разбросан оставленный кем-то мусор. "
        e "Мусор и старые вещи. "
        e "Периодически её взгляд замечал пустые бутылки, окурки, пустые пакеты и фантики от конфет…"
        
        LW "- Мусор и хлам {w=1}– вот первые признаки цивилизации,"

        e "- констатировала Маленькая Ведьма,"

        LW "- А значит {w=1} – люди, успевшие столько намусорить, жили здесь совсем недавно. "
        LW "Но куда они все исчезли? "
        LW "Куда могли деться?"

        e "Это ее и пугало больше всего, пугало до дрожи в коленях. "
        e "Туман, надвинутый на город, как вязаная шапка на глаза, обволакивал её, становясь все гуще. "
        e "Он был мерзким, сырым и противным, и не сулящим ничего хорошего."

        e "В какой-то момент Маленькая Ведьма поймала краем взгляда яркое, "
        e "аляповатое пятно. "
        e "Спешно повернув голову, она увидела яркий рисунок на стене: роскошный павлин, "
        e "дразнивший её распущенным, словно веер, многоцветным хвостом."
        e "Недалеко от этого странного граффити располагалась летняя веранда опустевшего кафе,"
        e "заставленная смотревшимися почти инородно пластиковыми столами и стульчиками. "
        e "Над слегка приоткрытой дверью заведения горела ало-неоновая вывеска, "
        e "написанная готическим шрифтом, справа от которой мерцало зловещим оккультным блеском «чёрное солнце»."

        LW "- Ahnenerbe, "

        e "- прочитала Маленькая Ведьма."

        e "Девочка приотворила дверь, заглянув внутрь. "
        e "Заведение было пустым и безлюдным, но прибранным будто пару часов назад. "
        e "Обстановка была вполне себе...{w=1} комфортной. "
        e "Внутри всё было стилизовано под средневековую таверну,"
        e " с каменными стенами и крепко-дубовым дощатым полом, деревянными крепко сбитыми круглыми столиками,"
        e " классическими пивными и винными бочками за питейной стойкой. "

        e "И только противоестественная пустота и безмолвие делали это место жутким."
        e "Маленькая Ведьма смотрела на закреплённые на стенах динамики, из которых должна была раздаваться бодрая музыка… "
        e "На стойку, подле которой положено собираться очереди воздающих подношения Бахусу… "
        e "На столики, накрытые аккуратными клетчатыми скатертями, "
        e "и на каждом – аккуратно разложенные салфетницы, солонки и перечницы – но воспользоваться ими было некому… "

        LW "- Ау! Есть здесь кто-нибу… "

        e "- робко спросила, а затем запнулась Маленькая Ведьма… "
        e "Она увидела листок бумаги, лежавший на одном из стольков…"

        e "Подойдя, Маленькая Ведьма увидела, что это был самый заурядный листок, вырванный из школьной тетради в клетку. "
        e "Но вот незаурядным была нарисованная на нём чёрная кошка с двумя хвостами и красным бантом на шее. "
        e "Ниже была две строки, написанные мелким, убористым почерком."

        LW "- Зоопарк для людей. Чума во время пира… "

        e "- прочитала Маленькая Ведьма, после чего удивлённо пожала плечами."

        e "Перевернув листок, "
        e "Маленькая Ведьма увидела ещё одну надпись – в этот раз выполненную крупным,"
        e " размашистым почерком – явно вышедшую из-под руки кого-то другого. "

        LW "- Бойся своих желаний – иногда они сбываются… "

        e "- прочитала Маленькая Ведьма…"

        e "Опасливо оглянувшись по сторонам, Маленькая Ведьма не увидела никого и ничего. "

        LW "- Это – предупреждение? "

        e "? – недоумевала она,"

        LW "- Но от кого? Кто оставил этот листок?"

        e "Опустив свой взгляд на столик – она только сейчас заметила, что под тетрадным листком лежал небольшой чёрный предмет. "
        e "Подняв и рассмотрев его, Маленькая Ведьма поняла:"

        LW "- Это же пульт! От телевизора?... "

        e "– быстро поняла Маленькая Ведьма. "

        e "Вот только телевизоров в заведении не было, что и смутило её больше всего. "

        LW "- Но какой смысл в пульте – без телевизора? "
        LW "Разве единственное предназначение пультов – не в том, чтобы переключать телеканалы? "
        LW "Разве пульт без телевизора не бесполезен?... "

        e "– недоумевала Маленькая Ведьма, осознавая парадоксальность наличия пульта, но отсутствия телевизора. "

        e "Но ответа на её вопрос – не было. "
        e "А пульт – был в её руках. "
        e "Повертев его из стороны в сторону, Маленькая Ведьма убрала его в один из своих подсумков."

        e "Ещё раз оглянувшись по сторонам, Маленькая Ведьма поняла - в этом пустом заведении ей делать нечего. "
        e "Развернувшись, она не спеша вышла, а затем продолжила своё путь по улице затянутого туманом опустыненного города…"

        $ renpy.pause(3.0)
        centered "{i}Топ, топ...{/i} "
        $ renpy.pause(3.0)
        centered "{i}Топ, топ...{/i} "

        e "Вскоре Маленькая Ведьма вышла на перепутье. "
        e "Узкая улица упёрлась в длинный широкий бульвар, открывающий путь в две стороны. "
        e "На одном конце этого бульвара зоркий взгляд Маленькой Ведьмы различал центральную площадь города. "
        e "Оттуда доносился равномерный шум фонтана. "
        e "На другом же равноудалённом конце протягивался широкий проспект,"
        e "и откуда раздавались далёкие,"
        e "но всё же отчётливые звуки чего-то похожего на музыку – что после блужданий по безмолвному и пустому городу невольно пугало, "
        e "но одновременно и манило, словно песни сладкоголосых сирен. "

        LW "- Куда же мне пойти? "

        e "– задумалась Маленькая Ведьма."

        pass

    elif Cha_04 == 2:

        e " Воздух был холоден. "
        e "А ещё пронизан каким-то неописуемым ощущением пустоты. "
        e "Или одиночества. "
        e "Порывы ветра дули ей в спину, гоняя по брусчатой улице оставленный кем-то мусор."
        e "Маленькая ведьма подняла голову, глядя, "
        e "что стоит на улице между двумя рядами примкнутых друг к другу домов, напоминавших о старой Европе."

        LW "- Где я нахожусь…"
        LW "ЭЙ!!{w=1} ЕСТЬ {w=1}ЗДЕСЬ {W=1}КТО-НИБУДЬ?!!"

        e "Крик прозвучал в пустоту. "
        e "Словно камешек, сброшенный в бездонную пропасть. "
        e "Маленькой ведьме оставалось лишь стоять, озираясь, глядя на пустые глазницы окон. "
        e "В одном из них она, на мгновение, увидела цветок. "
        e "Розу, накрытую какой-то стеклянной колбой. "
        e "Она стояла на окне, алая и неувядаемая. "
        e "По правую сторону от неё сидела странная кукла мальчика в шарфике… "
        e "Похожем на её шарф. "
        e "Слева был плюшевый лис…"

        LW "- Какая странная композиция на окне стоит. "
        LW "Неувядающий цветок и эти двое. "
        LW "Космический странник, скитавшийся среди звёзд и планет. "
        LW "Его вечная, неугасимая любовь. "
        LW "И лис, воплощение бескорыстной дружбы и понимания между всеми формами разума…"

        e "Маленькая ведьма отвела свой взгляд от окна. "
        e "Дома выглядели старинно, сделанные из камня, "
        e "с деревянными оконными рамами, со ставнями на фасадах, "
        e "некоторые из которых были оборванны с петель, словно некому было взять и починить их."

        e "Маленькая ведьма шла. "
        e "Шла и шла, бродя по ветвистым улочкам и переулкам странного города. "
        e "Бродила, заглядывая в закоулки. "
        e "Каблуки её ботинок звонко стучали по старой, "
        e "истёртой веками брусчатке, взгляд ловил печальное однообразие и горькую, сиротскую пустоту. "
        e "Город был пуст, абсолютно пуст и безлюден."
        e "Сколько она ни бродила, сколько она ни рыскала, в городе не было никого – ни человека, ни кошки, ни собаки. "
        e "И ни звука слышно, лишь давящая, оглушающая тишина. "
        e "Ряды домов, лепнины и карнизы, оцинкованные водосточные трубы."
        e "Двухпокатые черепичные крыши, цвет которых невозможно было определить. "
        e "Старые, железные чёрные фонари, которые не горели. "
        e "Вдали виднелись пронзающие небеса готические шпили собора. "
        e "Старыми не горящими коваными фонарями. "
        e "Но на улицах был мусор."
        e "Мусор и старые вещи. "

        LW "- Мусор и хлам {w=1}– вот первые признаки цивилизации. "
        LW "А значит - люди здесь когда-то жили, раз успели столько намусорить."
        LW "Но куда они все исчезли?"
        LW "Куда могли деться?"

        e "Это ее и пугало больше всего, пугало до дрожи в коленях. "
        e "Туман, надвинутый на город, как вязаная шапка на глаза, "
        e "сгущался всё более, обволакивая её, становясь все гуще. "
        e "Он был мерзким, сырым и противным, и не сулящим ничего хорошего."

        e "Она поняла, что стоит не просто посреди улицы – она стояла на перепутье."
        e "На дороге, ведущей в две стороны, находившиеся на равном удалении."
        e "На одном конце была центральная площадь, где шумел фонтан, и шелест струй воды раздавался издалека. "
        e "На другом конце шёл широкий проспект, откуда раздавались далёкие, "
        e "но всё же отчётливые звуки какого-то представления, столь неожиданного и загадочного в этом опустевшем городе, что это даже пугало."

        LW "- Куда же мне пойти…"


        pass
 


    menu:
    
        "Налево":
            # фонтан

            e "Она вышла на площадь, где находился большой фонтан. "
            e "Струи воды изливались из пастей сплетенных змей в чаши, а из них - в блюдце фонтана, подобное маленькому озеру. "
            e "Вокруг него стояли стеклянные банки и бутылки различных форм и объемов, все они были наполнены водой. "
            e "Кто и для чего это сделал, ведьма не могла знать, это было вне её понимания."
            e "Но это говорило о том, что город далеко не так пуст, как производит впечатление."

            LW "- Их тут много. "
            LW "Но зачем они это сделали? "
            LW "И если сделали {w=1}– зачем было оставлять воду здесь, на площади?"

            e "Подумала про себя Маленькая ведьма или же произнесла это в слух, окидывая взглядом, пустую площадь. "
            e "Она была весьма широка, после всех этих средневековых узких улочек и проходов."
            e "По кругу находились множественные здания, из которых выделялась старая городская ратуша в готическом стиле, с острыми шпилями. "
            e "Немного поодаль было ещё одно, несколько меньше, "
            e "и выделявшееся из всего окружения своим изяществом классицизма с портиком, поддерживаемым колоннами. "
            e "Остальные дома были сравнительно приземистыми, но украшенными барочной лепниной старыми особнячками, очевидно принадлежавшими городской знати. "
            e "Площадь явно была исторической, знавшей много сотен лет жизни здешних обитателей, их быт и дела. "
            e "Множество жизней и судеб, множество людей должны были её наполнять, кто в прогулке, а кто за серьёзным делом. "
            e "Муравейник без муравьёв…"

            LW "- Куда же мне пойти…"
            
            menu:
                "Обойти фонтан.":

                    e "Маленькая ведьма обошла фонтан, направившись к примыкающей стороне улицы, которая вела прямо вниз. "
                    e "Вскоре, улица эта закончилась тупиком, бетонным «колодцем» вздымающихся вверх стен. "
                    e "Стены эти принадлежали домам более современным, века двадцатого, "
                    e "ибо на них не было украшений лепнины и прочих излишеств, и были они выше. "
                    e "Перед глазами Маленькой ведьмы стояло бетонное ступенчатое крыльцо. "
                    e "И чёрная дверь с потемневшей бронзовой затейливой ручкой, которая была слегка приоткрыта."
                    e "Словно приглашая вовнутрь. "
                    e "Её рука ощутила холодный и гладкий металл с вельветами узоров, тяжёлые железные петли проскрипели ржавым стоном."
                    e "Маленькая ведьма вошла внутрь."

                    jump podezd
                "под арку":
                    $ ppoints =+ 1

                    e ""
                    
                    jump Underthearch
                    
            
        "Направо":
            $ ppoints =+ 1
            #фестивал
            jump chapter4fest
            return

label podezd:
    menu:
        "Куда пойти"
        "На выход":
            LW "Дверь закрыта"
            jump podezd
        
        "К почтовому ящику":
            jump letterbox

        "На лестничную площадку":
            jump lest1

    return

label letterbox:

    if key == False:
        jump article
        
    elif key == True:
        jump lest1
        
    return