label fast_end:

    #$ DEND_01 = renpy.random.choice(['BEND_01', 'BEND_02'])
    
    $ mci = rgen.rgen() 
    $ DEND_01 = mci
    if DEND_01 == 1:

    #if DEND_01 == 'BEND_01':
    #if mci == 1:
        #(Вариант  Saitar1337)

        $ replica = renpy.random.choice([1, 2])

        if replica == 1:
        
            e "Сердце Маленькой Ведьмы бешено заколотилось, а холодный липкий страх сковал её тело."
            e "В оцепенении она наблюдала за неумолимо надвигавшейся паучихой, острые жала которой готовы впрыснуть в неё яд снов…  "
            e "В последний момент преодолев оцепенение, Маленькая Ведьма со всех ног кинулась в бегство…"

            e "Запоздалое, ибо кошмарное членистоногое было уже слишком близко. "
            e "Пушистый светящийся ковёр голубого мха рвался под её сапогами,"
            e "когда она, несколько раз едва не упав, петляла, хватаясь руками за естественные колонны сросшихся воедино сталактитов и сталагмитов."
            e "Но паучиха была быстрее. "
            e "Её тонкие, будто проволочные ножки, несли существо с неожиданной проворностью и грацией для подобного существа…"

            e "А затем чёрная паучиха совершила ловкий прыжок, "
            e "неожиданно грациозный для подобного существа. "
            e "В одно мгновение, она оказалась на спине Маленькой Ведьмы. "
            e "Её острые жала впились в девичью шею, впрыскивая в её кровь яд снов… "

            e "Маленькая Ведьма вскрикнула от острой, пронзающей боли, но её крик вскоре оказался сдавлен молниеносным онемением языка и горла. "
            e "Она ощутила холод, разливающийся по венам словно ртуть. "
            e "Мир завертелся, словно на карусели.  "
            e "Зрение утратило резкость, а звуки стали приглушёнными. "
            e "Ноги стали ватными, а тело начало терять контроль над его отдельными членами."
            e "Чувствуя хватку мощного яда, во впрыснутой дозе убивающего за считанные минуты, девочка попыталась дотянуться до подсумка,"
            e "в котором хранился антидот – но её пальцы так и не смогли этот подсумок открыть."
            e "Из последних сил она пыталась остаться в сознании – но уже не чувствовала своего тела…"

            e "Ее глаза начали слипаться, и она провалилась в тягучую и вечную тьму… "

            e "*********************************"

            pass

        if replica == 2:

            e "Сердце Маленькой Ведьмы наполнила паника, когда кошмарный паук снов быстро сократил расстояние между ними. "
            e "Она инстинктивно бросилась бежать, с головокружительной скоростью продираясь сквозь пушистый ковер моха. "
            e "Существо, однако, было быстрее, его тонкие ножки плавно несли ее по камням. "
            e "Воздух затрещал от напряжения, когда началась погоня, сердце Маленькой ведьмы бешено колотилось в грудной клетке."
            e "Она отчаянно петляла между камнями и сталагмитов, надеясь перехитрить своего преследователя, но паук снов был неумолим."

            e "Маленькая Ведьма ахнула. "
            e "Острые, как бритва, клыки Кошмарного паука вонзились в ее плоть, и впрыскивая в ее кровь мощную дозу своего яда сновидений. "
            e "Яд мгновенно потек по ее венам. "
            e "Мир вышел из-под контроля и закружился вокруг нее, когда действие токсина усилилось,"
            e " оставив ее чувствовать себя беспомощной и дезориентированной, лишая ее чувств и сил. "
            e "Каждое движение давалось ей с трудом, конечности казались тяжелыми и свинцовыми. "
            e "Маленькая ведьма изо всех сил старалась оставаться в сознании, зная, что хватка яда крепнет с каждой секундой. "
            e "Девочка пытаясь дотянуться до подсумки с противоядием, но ее конечности отяжелели и онемели. "
            e "Темнота начала застилать ей глаза, а звук приближающегося чудовища стал приглушенным и отдаленным. "
            e "Она пыталась оставаться в сознании, но хватка яда была слишком сильной. "
            e "Когда ее глаза закрылись, последнее, что она увидела, был кошмарный паук, приближавшийся к ней со смертельным намерением."

            pass
        pass



    #elif DEND_01 == 'BEND_02':
    elif DEND_01 == 2:

        $ replica = renpy.random.choice([1, 2])

        if replica == 1:
            #block of code to run

            #(Вариант AngelRanga )

            e "Холодный липкий страх сковал Маленькую Ведьму, "
            e "что в оцепенении наблюдала за неумолимо надвигавшейся паучихой, "
            e "острые жала которой готовы впрыснуть в неё яд снов… "
            e "В последний момент преодолев оцепенение, Маленькая Ведьма кинулась со всех ног. "

            e "  Но было поздно {w=1}– оказавшись слишком близко, "
            e "чёрная паучиха совершила ловкий прыжок, неожиданно грациозный для подобного существа. "
            e "Её острее жала впились Маленькой Ведьме в шею, впрыскивая яд снов… "

            e "Сперва девочка почувствовала жгучую, пронзающую боль. "
            e "Затем – холод. "
            e "Ноги стали ватными, а тело начало неметь. "
            e "Мир завертелся, словно на карусели. "
            e "Девочка попыталась дотянуться до подсумка, "
            e "в котором хранился антидот {w=1}– но её пальцы так и не смогли этот подсумок открыть. "
            e "Она уже не чувствовала своего тела…"

            e "Ее глаза начали слипаться, и она провалилась в тягучую и вечную тьму… "

            e "****************************"

            pass

        if replica == 2:
            #block of code to run

            e "Где-то в глубине пещеры раздался тихий шорох. "
            e "Сначала едва слышный, он быстро нарастал, превращаясь в мерный стук множества лап по камню. "
            e "Девочка обернулась — из тёмных проходов появлялись другие пауки. "
            e "Не такие крупные, как самец перед ней, но их было много. "
            e "Десятки глаз отражали свет мха, создавая иллюзию звёздного неба, опрокинутого вниз."

            e "Она поняла: это ловушка. "
            e "Паутина грёз не просто привлекала добычу — она была сигнальным маяком для всей колонии. "
            e "И теперь, когда девочка оказалась слишком близко, пауки пришли на зов."

            e "Ведьма уже ясно видела острые жала паучихи грез с железами, наполненными ядом снов. "
            e "Но она не решилась сразиться с паучихай, и поэтому…"

            e "Маленькая Ведьма кинулась со всех ног."

            e "Но черная тень мигам нагнала ее. "

            e "Она почувствовала острую пронзающую боль в области шее."

            e "И весь мир вокруг нее завертелся, словно на карусели."

            e "Яд Пауков Снов очень силен, смерть от него наступает в считанные минуты. "

            e "Девочка попыталась дотянуться до подсумки, где хранился антидот, но она уже не чувствовала своего тела. "

            e "А где-то неподалеку она слышала шипения приближающейся черной смерти."

            e "Ее глаза начали слипаться, и она провалилась в тягучую и вечную тьму."

            e "Внезапно в мистическом поле тумана она увидела медленно кружившихся людей-птиц."

            LW " Призраки? "
            LW "Привидения?"
            LW "Галлюцинация? "
            LW "Бред?"

            pass

        pass

    else:

        #e "вариант 3"

        jump fast_end

    

    e "........."
    e "......"
    e "..."

    scene DEnd with Dissolve(5, time_warp=_warper.easein_quart) #dissA
    
    centered "{font=fonts/CeltesSP2.otf}{color=#d16f6a}{i}{size=+45}ПЛОХАЯ КОНЦОВКА. ВЫ ПОГИБЛИ.{/size}{/i}{/color}{/font}"
    centered "{font=fonts/CeltesSP2.otf}{color=#7fbdbf}{i}{size=+25}Попробуйте выбрать другой вариант. {/size}{/i}{/color}{/font}"


    jump end
    return