label Underthearch:


    #$ Cha_04_Und = renpy.random.choice([1, 2])

    #if Cha_04_Und ==1:
    if Under_01 == True: 


        e "Маленькая ведьма оглянулась. "

        e "Улица та была просторной, шире обычных узких улочек. "
        e "Очевидно, здесь располагалось множество магазинчиков, стоявших в запустении, с вывесками и витринами. "

        e "Иные были с разбитыми стёклами. "

        e "Несколько раз по дороге она встретила таких же чудовищ."

        e "Они медленно ходили между домами, но на девочку внимания почти не обращали - только оглядывались."

        e "Девочка медленно осматривается, взгляд её внимательно скользит по опустевшим зданиям и брошенному мусору. "
        e "В воздухе действительно чувствуется какая-то тревожная пустота."

        LW "«- Этот город... он как сломанная мечта,» "

        e "- шепчет она себе под нос, глядя на окна домов. "
        e "В одном из них мелькает тень — но нет звуков шагов или голоса."

        e "Она делает ещё несколько шагов,"
        e " внимательно рассматривая каждую мелочь на своём пути — каждую трещину на стенах, каждую брошенную вещь."
        e "Всё вокруг выглядит заброшенным, словно люди здесь давно покинули этот город."

        e "Маленькая Ведьма на секунду замирает, ее серебристые глаза сужаются от подозрения. "
        e "Она резко поворачивается в сторону, но вокруг — лишь пустые улицы."

        e "Лёгкие шаги стихли совсем. "
        e "Переулок поглотил мёртвой тишиной, только сердце колотится будто нестерпимой болью внутри грудной клетки. "

        e "Вдалеке виднелась чёрная тень, сидевшая на скамейке. "

        e "Маленькая ведьма ускорила шаг, почти до лёгкого бега, её каблучки звонко стучали по мостовой."

        e "Там кто-то сидел! "

        e "В чёрном балахоне и в белой маске."

        e "..."

        LW "- Вы меня слышите?"

        e "И маленькая ведьма подошла ближе. Своим вопросом она хотела привлечь к себе внимание."

        Ananim " — Слышу."

        e "Ответил тот, кто сидел на скамейки, не поворачивая головы и не прекращая своего занятия. "
        e "Рядом на скамейке лежала целая куча маленьких камешков, которые один за другим отправлялись в мешочек."

        e "Маленькая ведьма села рядом с неизвестным."

        LW "— Здравствуйте."

        Ananim "— Привет. Подожди…"

        e "Отозвавшись на приветствие, незнакомец вскинул руку. "
        e "И снял с себя маску."
        e "Маленькая ведьма шарахнулась, пятясь назад. "
        e "Едва не упав со скамейки."

        e "Маска упала на землю, и..."

        e "На неё смотрело её лицо. "

        LW "— Это невозможно… {w=1}Я не верю этому! {w=1}Кто ттт… тты такая?.."

        Ananim "— Я такая же, как и ты."

        LW "— Но объясни!?"

        Ananim "— А зачем?"

        LW "— Всему на свете должно быть объяснение!"

        Ananim "— Тогда ладно… {w=1}Человек — это его лицо и его имя. "
        Ananim "Больше ничего.  "
        Ananim "Убери лицо и имя, и не останется ничего. "
        Ananim "Твои поступки ассоциируется с твоим именем, а черты характера — с лицом. "
        Ananim "Забери лицо и имя, и даже лучшему другу придётся долго доказывать - что ты это ты. "
        Ananim "Мне живётся легче, чем тебе. "
        Ananim "Ни лица, ни имени у меня не было никогда."
        Ananim "У тебя есть только лицо, но имени у тебя нет…"

        e "Она закрыла лицо ладонями, а когда открыла, оно уже было другим."

        e "...."

        e "Безликая подняла с земли маску и снова надела её."

        LW "— А где обитатели этого города? "

        e "Спросила маленькая ведьма через некоторое время."

        Ananim "— Здесь. "

        e "Безразлично ответила девушка."

        LW "— Нет, их здесь нет."

        Ananim "— Если ты чего-то не видишь, то это не значит, что этого нет."

        LW "— А что же это тогда значит?"

        Ananim "— Значит, что ты этого просто не видишь."

        LW "— Почему тогда я их не вижу?"

        Ananim "— Потому, что не видишь. "
        Ananim "Потому, что людей здесь можно увидеть только тогда, когда идёт дождь."
        Ananim "Ведь люди стремятся быть похожими друг на друга, и серая стена дождя превращает их в идущую по улицам толпу. "
        Ananim "То, что нужно людям, так проще... "
        Ananim "Тебе же интересно, почему людей видно только в дождь?"

        LW "— Да."

        Ananim "— Потому, что мэр города двести лет назад превратил всех ведьм в кошек."
        
        LW "- Какой ужас!"

        Ananim "— С тех пор ни одной кошки в этом городе не было."

        LW "— Понятно."

        Ananim "- А если я наплела чуши? "
        Ananim "Ты видишь что-то, чего не можешь понять, и удовлетворяешься первым попавшимся объяснением, потому что так уж устроен человек."

        LW "— Человек?"

        Ananim "— Да, человек. {w=1}Все. {w=1} И ты в том числе."

        LW "— А когда пойдёт дождь?"

        Ananim "— Тогда, когда ты захочешь, чтобы он пошёл, ведь ты ведьма, а ведьма связана с водой."

        LW "— Ну, тогда, "

        e "Маленькая ведьма огляделась, вдыхая воздух. "

        LW "— Пусть пойдёт сейчас!"

        e "С неба на лоб упало что-то влажное."

        e "Капля дождя."

        e "Ещё одна упала где-то рядом."

        LW "- Дождь! "
        LW "Он идёт… {w=1}Но у меня нет зонта…"

        e "Дождь шёл, всё чаще и чаще… "

        e "И вмиг – он стал ливнем, пронизывавшим насквозь, промачивающим до нитки. "
        e "Он беспощадно лил и хлестал, подобно тысяче бичей… "

        e "Маленькая ведьма пыталась скрыться, укрыться, найдя хоть где крышу."

        e "Сама собой, она заскочила под крыльцо какого-то дома."

        LW "- Меня теперь хоть выжимай… {w=1}Что это…"

        e "Маленькая ведьма увидела приоткрытую дверь."
        e "И след чёрной босой ступни, словно кто-то наступил босиком на масло или дёготь. "

        e "Маленькая ведьма открыла дверь до конца, "
        e "рука ощутила холодный и гладкий металл с вельветами узоров,"
        e " тяжёлые железные петли проскрипели ржавым стоном. "

        e "Маленькая ведьма зашла в подъезд."



        jump podezd
        pass


    
    #elif Cha_04_Und ==2:
    elif Under_01 == False:
        
        e "Маленькая ведьма оглянулась. "
        e "Много правее фонтана была арка, которая вела на одну из достаточно широких боковых улиц, ответвлявшихся под углом."
        e "Что-то манило её туда. "
        e "Что-то немыслимое и иррациональное, но ей хотелось туда пройти. "
        e "Но, словно другой голос за плечом, что-то толкало её обойти этот фонтан кругом. "
        e "И заглянуть на противоположную сторону площади."

        e "Улица та была просторной, шире обычных узких улочек. "
        e "Очевидно, здесь располагалось множество магазинчиков, стоявших в запустении, "
        e "с вывесками и витринами, за которыми стояли причудливо наряженные манекены. "

        #В витрине магазина вставит фон с отсылкой на тохо. 
        #Ряд манекенов среди которых угадывается одна из тохо-девочек. Пресеты использовать с ремонтной мастерской кукол 

        e "Иные были с разбитыми стёклами. "
        e "Её взгляд цепляется за разбитую витрину магазинчика или ремонтной мастерской. "
        e "А потом и за трубу буржуйки, торчавшую из разбитой витрины, из нее шел дым."

        centered "{font=fonts/Arial.ttf}{size=+20}{i}«Ремонт Солнечных Кукол». {/i}{/size}{/font}\n
                    {font=fonts/TrixieCyr-Light.ttf}«iDolls и TDolls»{/fond}\n
                    {font=fonts/DS-Moster.ttf} «быстро, качественно, {s}не{/s}дорого»{/font}"

        centered "{font=fonts/Arial.ttf}{size=+20}{i}«Улица Азазело» {/i}{/size}{/font}"

        #menu:
            #"Say Statement"
            #"Зайти":
                #block of code to run

                #e ".."


                #jump end
                #pass
            
            #"Пройти мимо":
                #block of code to run
                #$ Underthearch_01 = True

                #e "..."
                #pass

        e "Вдалеке виднелась чёрная тень, сидевшая на скамейке. "

        e "Маленькая ведьма ускорила шаг, почти до лёгкого бега, её каблучки звонко стучали по мостовой."

        e "Там кто-то сидел! "

        e "Кто-то живой. "

        e "В чёрном балахоне и в белой маске."

        e "..."

        LW "- Вы меня слышите?"

        e "И маленькая ведьма подошла ближе. Своим вопросом она хотела привлечь к себе внимание."

        Ananim " — Слышу."

        e "Ответил тот, кто сидел на скамейки, не поворачивая головы и не прекращая своего занятия. "
        e "Рядом на скамейке лежала целая куча маленьких камешков, которые один за другим отправлялись в мешочек."

        e "Маленькая ведьма села рядом с неизвестным."

        LW "— Здравствуйте."

        Ananim "— Привет. Подожди…"

        e "Отозвавшись на приветствие, незнакомец вскинул руку. "
        e "И снял с себя маску."
        e "Маленькая ведьма шарахнулась, пятясь назад. "
        e "Едва не упав со скамейки."

        e "Маска упала на землю, и..."

        e "На неё смотрело её лицо. "

        LW "— Это невозможно… {w=1}Я не верю этому! {w=1}Кто ттт… тты такая?.."

        Ananim "— Я такая же, как и ты."

        LW "— Но объясни!?"

        Ananim "— А зачем?"

        LW "— Всему на свете должно быть объяснение!"

        Ananim "— Тогда ладно… {w=1}Человек — это его лицо и его имя. "
        Ananim "Больше ничего.  "
        Ananim "Убери лицо и имя, и не останется ничего. "
        Ananim "Твои поступки ассоциируется с твоим именем, а черты характера — с лицом. "
        Ananim "Забери лицо и имя, и даже лучшему другу придётся долго доказывать - что ты это ты. "
        Ananim "Мне живётся легче, чем тебе. "
        Ananim "Ни лица, ни имени у меня не было никогда."
        Ananim "У тебя есть только лицо, но имени у тебя нет…"

        e "Она закрыла лицо ладонями, а когда открыла, оно уже было другим."

        e "...."

        e "Безликая подняла с земли маску и снова надела её."

        LW "— А где обитатели этого города? "

        e "Спросила маленькая ведьма через некоторое время."

        Ananim "— Здесь. "

        e "Безразлично ответила девушка."

        LW "— Нет, их здесь нет."

        Ananim "— Если ты чего-то не видишь, то это не значит, что этого нет."

        LW "— А что же это тогда значит?"

        Ananim "— Значит, что ты этого просто не видишь."

        LW "— Почему тогда я их не вижу?"

        Ananim "— Потому, что не видишь. "
        Ananim "Потому, что людей здесь можно увидеть только тогда, когда идёт дождь."
        Ananim "Ведь люди стремятся быть похожими друг на друга, и серая стена дождя превращает их в идущую по улицам толпу. "
        Ananim "То, что нужно людям, так проще... "
        Ananim "Тебе же интересно, почему людей видно только в дождь?"

        LW "— Да."

        Ananim "— Потому, что мэр города двести лет назад превратил всех ведьм в кошек."
        
        LW "- Какой ужас!"

        Ananim "— С тех пор ни одной кошки в этом городе не было."

        LW "— Понятно."

        Ananim "- А если я наплела чуши? "
        Ananim "Ты видишь что-то, чего не можешь понять, и удовлетворяешься первым попавшимся объяснением, потому что так уж устроен человек."

        LW "— Человек?"

        Ananim "— Да, человек. {w=1}Все. {w=1} И ты в том числе."

        LW "— А когда пойдёт дождь?"

        Ananim "— Тогда, когда ты захочешь, чтобы он пошёл, ведь ты ведьма, а ведьма связана с водой."

        LW "— Ну, тогда, "

        e "Маленькая ведьма огляделась, вдыхая воздух. "

        LW "— Пусть пойдёт сейчас!"

        e "С неба на лоб упало что-то влажное."

        e "Капля дождя."

        e "Ещё одна упала где-то рядом."

        LW "- Дождь! "
        LW "Он идёт… {w=1}Но у меня нет зонта…"

        e "Дождь шёл, всё чаще и чаще… "

        e "И вмиг – он стал ливнем, пронизывавшим насквозь, промачивающим до нитки. "
        e "Он беспощадно лил и хлестал, подобно тысяче бичей… "

        e "Маленькая ведьма пыталась скрыться, укрыться, найдя хоть где крышу."

        e "Сама собой, она заскочила под крыльцо какого-то дома."

        LW "- Меня теперь хоть выжимай… {w=1}Что это…"

        e "Маленькая ведьма увидела приоткрытую дверь."
        e "И след чёрной босой ступни, словно кто-то наступил босиком на масло или дёготь. "

        e "Маленькая ведьма открыла дверь до конца, "
        e "рука ощутила холодный и гладкий металл с вельветами узоров,"
        e " тяжёлые железные петли проскрипели ржавым стоном. "

        e "Маленькая ведьма зашла в подъезд."



        jump podezd
        pass

return
    