label room_020:
    #туалет

    e "....."

    e "Маленькая ведьма попала в комнату облицованную белым кафелем и с странным запахом."
    e "На одной из стен висело большое зеркало, под которым располагался ряд умывальников. "
    e "На противоположной же стороне комнате были что-то вроде кабинок с перегородками и с отсутствующими дверями. "

    e "Девочка открывала двери по очередно и рассмотрела, что в пол этих кабинок были вмонтированы ниши. "
    e "Девочка поняла, что это быль дамский туалет."
    e "И рас она в нем оказалась… "
    e "То почему б им не воспользоваться. "
    e "Она к этому моменту очень хотела."

    e "Девочка вошла в кабинку, "
    e "встав над нишей. "
    e "И подняв подол своего платьице, стала развязывать ленточку, держащую её панталончики."
    e "Когда она спустила их обнажив свои ягодицы. "

    e "Девочка присела..."

    e "Девочка слегка смутилась, на самом деле с ней это редко бывает. "
    e "Она осознавала факт того что испытывала напряженность в низу живота, "
    e "уже некоторое время назад, от которой, она хотела избавиться. "

    e "Она расслабилась и начала... писать. "
    e "Из щелочки девочки вырвался золотистый непоседливый ручеек. "
    e "Он весело журчал, и маленькая ведьма чувствовала свое облегчения в области ниже живота. "



    e "В ее голове промелькнула мысль, озарившее ее сознание: "

    LW "«А когда она собственно ходила в последний раз?». "

    e "Осознание этого факта вернула часть воспоминаний. "
    e "{i}Пауки Снов, сеть Грёз, пещера Иллюзий…{/i}"

    e "Во снах нет лжи, память скрывает истину, которую знает только спящий человек,"
    e " сноходцы сами скрываются от самих себя, но сны не солгут. "

    e "Память вещей память истории – те же сны, общие сны, всего живого."

    e "Почему-то этот внезапно взволновала маленькую ведьму. "
    e "И она начала ощущать некое возбуждения. "

    e "Когда она сделала свое дело, она снова вышла в коридор."

    $ Room_20 = True
    #$ WCRoom = True
    $ WCC = True

    jump coridor_05

    return