label room_018:
    #Комната с видом на улицу

    e "....."

    e "Некоторые из дверей открывались и перед взором девочки открывались комнаты. "
    e "Двери впускали юную гостью внутрь квартир. "
    e "Она была довольно велика для городского жилья в подобном доме, но казалась какими-то пустыми и совершенно заброшенными. "
    e "Длинный коридор, комнаты с высокими потолками. "
    e "Все здесь было старое, пропасшееся пылью и заброшенностью. "
    e "Будь это линялые, ободранные обои в дырках, с нарисованным немыслимым узором пляшущих фигур."
    e "Будь это скромное убранство из старой мебели, или оборванные занавески на окнах. "
    e "Все было покрыто густым белым слоем пыли, словно запорошенные снегом улицы. "
    e "И столик, и трюмо, и старое лакированное пианино..."
    e "Маленькая ведьма ходила из комнаты в комнату, везде наблюдая лишь единообразную пустоту. "

    LW "- Есть здесь кто?.."

    e "Едва она это сказала, старая рассохшаяся половица скрипнула под её осторожным шагом, "
    e "и в этом звуке ей почудилось было едва различимое слово. "
    e "От неожиданности она остановилась и огляделась, комната была такой же, как и была."
    e "Мороз по коже… "
    e "От этой тишины ей было уже глубоко не посебе, а воображение рисовало загадочные и пугающие, но при этом манящие картины."

    LW "- Или это моё разыгравшееся воображение…"

    e "Она подошла к окну, выглянув на улицу. "
    e "Перед её взором предстал городской вид, погружённый в тягучий как патоку туман, "
    e "через который просвечивали лишь тусклые сферы автоматически зажегшихся фонарей. "
    e "Они едва освещали булыжную мостовую, лишь слабо озаряя окрестность, "
    e "подобно диковинной светящейся приманке на «удочке» чудовищных и безобразных глубоководных рыб."
    e "Небо было затянуто, от него пахло сыростью и скорбью…"

    Ananim " - Проснись... {w=1}Пробудись ото сна…"

    e "Этот голос, звонкий и зловещий, заставил ведьмочку обернуться, пройдя по спине острым льдом."

    LW "- Здесь кто-то есть?"
    LW " Кто-то… {w=1}Живой?"

    e "Маленькая Ведьма выскочила в коридор."

    $ Room_18 = True

    jump coridor_05

    return