label room_028:
    #У нас было два пакета травы 75 таблеток
    #в общем из страха и неновисти
    # Комната разромлена. а из записок или еще чего-то отсылка на фильм
    # можно сделат пикселхантинг на вешество с химической структурой похожей на кролика

    #Гнездо параноика, жилец напоминающий
    #пророка глема из киберпанка. В записках он говорит о 
    #жидо-рептилойдах
    #и педофилах-рептилойдах в правительстве, и их мессах на острове,
    #ссылаяс на маджестик 12. он говорит что люди ему не
    #верят и насмехаються над ним. по этому он собираеться доказать 
    #существование пришелцев соседки по комнате. подмешав ей сильно 
    #действующий препарад, 
    #и прикинувшися "серым". 
    #чучело-костум серого МВ находит в его комнате.


    #Псевдозакрытая комната.
    #доступ к которой может быть 
    #получен с помощью фомки.




    e "....."

    $ Room_28 = True
    $ enigma_01 = True

    jump hallway_07

    return